{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "18245960", "review_id": "dfdbb7b0eb5a7e4c26d59a937e2e5feb", "rating": 5, "review_text": "This is a special book. It started slow for about the first third, then in the middle third it started to get interesting, then the last third blew my mind. This is what I love about good science fiction - it pushes your thinking about where things can go. \n It is a 2015 Hugo winner, and translated from its original Chinese, which made it interesting in just a different way from most things I've read. For instance the intermixing of Chinese revolutionary history - how they kept accusing people of being \"reactionaries\", etc. \n It is a book about science, and aliens. The science described in the book is impressive - its a book grounded in physics and pretty accurate as far as I could tell. Though when it got to folding protons into 8 dimensions I think he was just making stuff up - interesting to think about though. \n But what would happen if our SETI stations received a message - if we found someone was out there - and the person monitoring and answering the signal on our side was disillusioned? That part of the book was a bit dark - I would like to think human reaction to discovering alien civilization that is hostile would be more like Enders Game where we would band together. \n I did like how the book unveiled the Trisolaran culture through the game. It was a smart way to build empathy with them and also understand what they've gone through across so many centuries. And who know a 3 body problem was an unsolvable math problem? But I still don't get who made the game - maybe that will come in the next book. \n I loved this quote: \n \"In the long history of scientific progress, how many protons have been smashed apart in accelerators by physicists? How many neutrons and electrons? Probably no fewer than a hundred million. Every collision was probably the end of the civilizations and intelligences in a microcosmos. In fact, even in nature, the destruction of universes must be happening at every second--for example, through the decay of neutrons. Also, a high-energy cosmic ray entering the atmosphere may destroy thousands of such miniature universes....\"", "date_added": "Sun Jul 30 07:44:10 -0700 2017", "date_updated": "Wed Aug 30 00:00:26 -0700 2017", "read_at": "Sat Aug 26 12:05:52 -0700 2017", "started_at": "Tue Aug 15 13:23:18 -0700 2017", "n_votes": 28, "n_comments": 1}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "5577844", "review_id": "52c8ac49496c153e4a97161e36b2db55", "rating": 5, "review_text": "A beautiful story. Neil Gaiman is truly a unique storyteller. I did a combo of reading and listening to this story, and Neil is great at reading as well. I got interested in this book after seeing the movie, which I really enjoyed. The book is similar - maybe a bit more poetic - but I think the plot in the movie is a bit improved (not much, but a bit). \n I imagine this book came about because Neil read the below poem that he includes in the beginning, and then he invented a plot around it. The result is the book reads like a epic poem - it's creative, magical, and really, just right. \n Go and catch a falling star, \n Get with child a mandrake root, \n Tell me where all past years are, \n Or who cleft the devil's foot, \n Teach me to hear mermaids singing, \n Or to keep off envy's stinging, \n And find \n What wind \n Serves to advance an honest mind. \n If thou be'st born to strange sights, \n Things invisible to see, \n Ride ten thousand days and nights, \n Till age snow white hairs on thee, \n Thou, when thou return'st, wilt tell me, \n All strange wonders that befell thee, \n And swear, \n No where \n Lives a woman true, and fair. \n If thou find'st one, let me know, \n Such a pilgrimage were sweet; \n Yet do not, I would not go, \n Though at next door we might meet; \n Though she were true, when you met her, \n And last, till you write your letter, \n Yet she \n Will be \n False, ere I come, to two, or three. \n And here is my new favorite quote: \"Have been unavoidably detained by the world. Expect us when you see us.\"", "date_added": "Wed Sep 24 09:29:29 -0700 2014", "date_updated": "Wed Oct 01 00:31:56 -0700 2014", "read_at": "Tue Sep 30 00:00:00 -0700 2014", "started_at": "Sun Sep 21 00:00:00 -0700 2014", "n_votes": 5, "n_comments": 1}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "17315048", "review_id": "885c772fb033b041f42d57cef5be0a43", "rating": 5, "review_text": "Mark Watney is a steely-eyed missile man. A man's man. A badass mechanical engineer botanist astronaut who is stranded on Mars during a Nasa mission gone wrong, and left to fend for himself. I listened to this on audio on a roadtrip, and it flew by - what a fun story. Not surprised at all it's being made into a movie directed by Ridley Scott starring Matt Damon. Also pretty amazing is that it was self-published. \n There were two great things about this book: the humor and the science. The science appealed to the mechanical engineer in me - Watney is a bit like McGyver except he knows a lot more about chemistry and botany. I didn't double-check all the science, but loved the descriptions of all the math: calorie calculations, creating water, etc. Just fun stuff. \n But the humor was top notch. Weir does a great job portraying a stranded man trying to remain upbeat by talking to himself in log entries. And the excellent audio narrator only made it better. \n \"I started the day with some nothin' tea. Nothin' tea is easy to make. First, get some hot water, then add nothin'.\" \n \"Yes, of course duct tape works in a near-vacuum. Duct tape works anywhere. Duct tape is magic and should be worshiped.\" \n \"Live Another Sol would be an awesome name for a James Bond movie.\" \n In the end, a well told story of survival against the odds. And one of belief - I liked the CNN Mark Watney watch - you could totally imagine how into this story the media would get. We humans love a good surviving against the odds story.", "date_added": "Sat Apr 05 09:30:53 -0700 2014", "date_updated": "Wed Mar 22 11:33:10 -0700 2017", "read_at": "Mon Aug 25 00:00:00 -0700 2014", "started_at": "Sat Aug 16 00:00:00 -0700 2014", "n_votes": 25, "n_comments": 5}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "13453029", "review_id": "46a6e1a14e8afc82d221fec0a2bd3dd0", "rating": 4, "review_text": "A fun fast paced book that sucks you in right away and doesn't let go. The remnants of humanity live in a 150 story silo below the earth and can't leave as the outside is now toxic. This is a bit of an odd thing to have happened, but it gives us a nice palette to think about things. \n Everything is rationed, including how many children you can have. People self-identify by their profession and where in the silo they live: farmers and mechanics in the lowers, IT in the mids, and professional class in the uppers. The working class wear color coded uniforms to easily distinguish them. \n The book was a lot about control. How to control a contained civilization, and give them hope (eg a live feed of the outside) and yet keep them in harmony and doing their functions. Strange mechanisms of control were built all over the silo: communication was oddly limited given the IT resources they have - many messages had to be delivered by courier as emails cost valuable money to send. Most strange of all - there is no elevator, which forces anyone wanting to travel the length of the silo to spend 2-3 days on the journey. \n The cleaning ritual was a strange bit of culture. Upon reflection, I can see why it was necessary. If people never go outside, uncertainty of it still being bad would creep in, and people would need to try it. As perhaps happened in Silo 17. \n I really liked the unraveling of Bernard, and how he went from repulsive/annoying, to understandable once you understood his role and responsibility. His role is to eliminate any doubt in the delicate balance of the silo. Opening the book up with the doubt of Holston was brilliant as it sucked you in immediately. \n I liked Juliet too - she was the right combo of being determined to do right, and having brains and grit.", "date_added": "Tue Dec 04 11:12:22 -0800 2012", "date_updated": "Sat Jul 26 11:43:28 -0700 2014", "read_at": "Tue Jul 08 00:00:00 -0700 2014", "started_at": "Wed Jul 02 00:00:00 -0700 2014", "n_votes": 5, "n_comments": 1}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "13239822", "review_id": "a582bfa8efd69d453a5a21a678046b36", "rating": 3, "review_text": "This book has a great premise, and is full of some beautifully written prose. It's about a hacker during the Arab Spring, helping people get around the firewalls that the State erected to control its population. Alif falls in love, finds an ancient book, gets into trouble with State, enlists the help of an unseen, magical world full of creatures call Jinn, and combats evil. The story flowed well, and was a fast, fun read. \n I would have given it a higher rating, but I'm a computer programmer, and for a book that is about hacking the descriptions of Alif coding felt like I was watching one of those movies where they used a bunch of made-up visuals that have nothing to do with hacking. The prose around the hacking was so oddly descriptive you didn't know what to make of it. For instance, when Alif is hacking into State's intranet, it is described as: \n \"The Hand roused. It lumbered to its feet, reeking of ionized air and dry metallic bones, revealing a level of functionality Alif had not detected. He reeled backward, recalibrating. Breaching the confines of the State intranet, the Hand began to attack the base of Alif's tower, slicing away layers of code through a mirroring protocol of a kind Alif had never seen before.\" \n I didn't know a computer program could \"reek of ionized air\" - and can't conceive of how a mirroring protocol (if there is such a thing) could ever be used to \"slice away layers of code\". \n I wanted so hard for the bit about quantum computing and encoding the ancient story into code to make sense. But it just didn't. And that was the heart of the story - that the ancient text contained an all-powerful computer algorithm. I also had trouble buying the Alif & Dina relationship - the characters just felt shallow to me.", "date_added": "Mon Jul 02 16:04:16 -0700 2012", "date_updated": "Wed Mar 22 11:32:20 -0700 2017", "read_at": "Wed Aug 15 00:00:00 -0700 2012", "started_at": "Sun Aug 12 00:00:00 -0700 2012", "n_votes": 7, "n_comments": 0}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "62291", "review_id": "e23965adda7ce7e7e415a1339e169065", "rating": 5, "review_text": "** spoiler alert ** \n Loved it. The epic saga continues. The poor Starks are torn apart, but yet are surprisingly resilient. In fact, pretty much every major character is in danger of dying and some even do. It's a bit tough to read, as you really wanted The King In The North to succeed. And Dany is fast becoming an interesting part of the plot that has yet to intermix with the rest of the characters. \n I'll be starting the next one soon. These books are like crack.", "date_added": "Tue Jul 12 12:57:07 -0700 2011", "date_updated": "Wed Mar 22 11:47:02 -0700 2017", "read_at": "Sat Aug 20 00:00:00 -0700 2011", "started_at": "Tue Jul 26 00:00:00 -0700 2011", "n_votes": 5, "n_comments": 1}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "41804", "review_id": "2bcbe2300fe1801197f9bfe1f1c883ba", "rating": 5, "review_text": "As an engineer I couldn't help but love this book. It's full of logic games! The 3 rules of robotics are a very rich medium for lots of fun puzzles, and I very much enjoyed reading them. I think the book originally came out in serial form, as it was broken down into short stories or capers. Kind of reminded me of Sherlock Holmes - another favorite of mine. \n Examining robots also gave a canvas for defining what it is to be human. I loved the robot religion story. Robots with a superiority complexes - but thank goodness for that first law or it would be a Terminator-style story. \n According to Asimov's predictions, in 2009 the robot revolution should be in full swing. But I don't see a lot of robots around. Anyone have a good prediction on where we are with robots? When will we have pet robots and robot laborers?", "date_added": "Wed Mar 25 10:56:59 -0700 2009", "date_updated": "Tue Apr 14 18:23:50 -0700 2009", "read_at": "Wed Apr 08 00:00:00 -0700 2009", "started_at": "", "n_votes": 12, "n_comments": 2}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "136251", "review_id": "132eab4c9a3724493204cc083e0e2ecc", "rating": 5, "review_text": "Loved every minute. So sad there isn't another! \n I thought JK really made Harry an even stronger archetypal hero - almost in a Paul Maud'Dib from Dune kind of way. He's fighting the ultimate evil, he's brave and takes risks, and believes in himself and doesn't give up despite many hardships. I think JK really did a phenomenal job, as I bet every kid who reads this will have a little bit of hero/Gryffindor in them. \n The epilogue was lame though. I would have rather seen a '3 months later' epilogue than a '19 years later' one.", "date_added": "Mon Dec 22 10:38:27 -0800 2008", "date_updated": "Wed Mar 22 11:46:18 -0700 2017", "read_at": "Sun Jan 02 00:00:00 -0800 2011", "started_at": "", "n_votes": 6, "n_comments": 3}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "142296", "review_id": "400f536181a8ccf3a0f6b37d3fec14eb", "rating": 4, "review_text": "I enjoyed every second of this book. I haven't read a time travel book in a long time, but loved this one, as the descriptions of London in 1812 were very rich. I loved how Lord Byron and other famous poets were running around, and the descriptions of all the beggars were fascinating. Add in some ancient Egyptian magic and you've got a great book! \n Random sidenote: It's interesting to think that back then poets were the rockstars of the age, as the only form of mass-media was newspapers, so those who mastered the written word could be broadcast much further than any musician or actor. How times have changed!", "date_added": "Sun Oct 19 13:52:40 -0700 2008", "date_updated": "Wed Mar 22 11:46:14 -0700 2017", "read_at": "Wed Dec 10 00:00:00 -0800 2008", "started_at": "", "n_votes": 6, "n_comments": 2}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "76620", "review_id": "9206654986a733bd753753aa0c882813", "rating": 5, "review_text": "I read this after hearing from a few people that it was among their all-time favorites. I was almost put off when I saw it was a story about rabbits, originally written as a tale by a father to his children - but I'm glad I wasn't. \n I found the folk tales about El-ahrairah to be very impressive. The author clearly had a vivid imagination to create so much of the rabbits culture and history. But I think this book was worth reading as it's really a story about survival, leadership, and human nature. \n Oh and Fiver rocks. And BigWig is the man.", "date_added": "Tue Sep 02 17:03:40 -0700 2008", "date_updated": "Wed Dec 14 12:30:43 -0800 2016", "read_at": "Tue May 05 00:00:00 -0700 2015", "started_at": "Sun Apr 19 00:00:00 -0700 2015", "n_votes": 30, "n_comments": 2}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "34497", "review_id": "43828b41e8099f892cfee80a8244684a", "rating": 3, "review_text": "This should be 3.5 stars. I really enjoyed it, but found it all kind of random and leading nowhere. That being said, it was very imaginative and entertaining. Hrun the Barbarian was one of my favorites, as was anything the Luggage did.", "date_added": "Tue Jun 03 16:42:44 -0700 2008", "date_updated": "Fri Dec 27 07:55:24 -0800 2013", "read_at": "Mon Nov 10 00:00:00 -0800 2008", "started_at": "", "n_votes": 2, "n_comments": 2}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "14497", "review_id": "b8e08587ce1592d69548d0f644cb9893", "rating": 4, "review_text": "** spoiler alert ** \n Just finished this and have to say I really enjoyed it. I was kind of worried the plot wasn't going anywhere for much of it, but the writing was really good and drew me in. \n For much of the book I thought the main character (Richard) was too weak of a character for me to like much, but I liked how he grew in confidence towards the end. I think anytime one undertake's an adventure or a journey like that you grow so much. You have to get out there and fail a few times to have the confidence to know how to succeed! \n I also have to say I loved Mister Croup and Mister Vandemar. Their dialogue and interaction was hilarious. It really reminded me of Mister Wint and Mister Kidd from James Bond's Diamonds are Forever.", "date_added": "Thu Mar 27 17:53:06 -0700 2008", "date_updated": "Wed Mar 22 11:46:03 -0700 2017", "read_at": "Tue Oct 28 00:00:00 -0700 2008", "started_at": "", "n_votes": 6, "n_comments": 1}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "77566", "review_id": "cedb8b21ea6ad95b05fa3868e05488e6", "rating": 5, "review_text": "Seven amazing stories. Each one you think can't possibly top the last, and then it does. We never really get to understand what is up with the Time Tombs - guess I have to keep reading. But the strength of each of these stories is worth it. One of the best books I've read in a while.", "date_added": "Wed Mar 12 16:37:16 -0700 2008", "date_updated": "Wed Mar 22 11:46:03 -0700 2017", "read_at": "Fri Oct 19 00:00:00 -0700 2012", "started_at": "Wed Sep 19 00:00:00 -0700 2012", "n_votes": 4, "n_comments": 2}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "897461", "review_id": "91e06a861712ad5a654f7c9829423049", "rating": 5, "review_text": "An epic book - loved it, and wish I had found it before now. It does start a bit slow, but then really picks up. It's the story of a young man in 1905ish who graduates from Harvard and then is sent by his rich uncle to be the consul to the made up country of Islandia, which is closed to trade with the outside world. \n Islandia is described so clearly you could almost believe it wasn't a made up country. You can feel it's beauty, it's pureness, and it's culure, coming through the pages. \n Many of us went through idealistic phases in our 20's, and John Lang is no exception. He is trying to decide what will make him happy: Islandia, or a life in New York as a businessman. He is also searching for love, and seems to have a crush on every Islandian woman he meets! \n Wright does an amazing job of describing what the Islandian culture is like. They are largely farmers: they work in the field all day, and their land provides what they need to eat and money to buy the rest. They don't have to work super hard, and have plenty of time for leisure. Their society closed and smaller, so people are very decent to each other. There aren't very many towns or central social hubs, so socializing is often accomplished by staying as a guest in someones farm house as you are traveling through the country, and you can do that totally unannounced. \n Islandia is a utopia of sorts - they believe that progress in their culture will not lead to improving their lives. It is an interesting question - does technological progress actually end up making our lives better? Technology is supposed to improve the quality of our lives. We have better medicines, cleaner cities, we can communicate instantly around the world, and travel on cars and trains and planes. \n But we lack the notion of a \"home\" that spans across generations or even multiple family units. Cousins and uncles and grandparents are only seen several times a year during family parties and holidays. In a sense, our society has shifted from being family centric to friend centric, as friends are the people we hang out with socially in the cities, where most of us live. This gives us often a richer variety of people and ideas to interact with, but the the connections are often not as close, and that is sad.", "date_added": "Wed Feb 06 20:42:04 -0800 2008", "date_updated": "Wed Mar 22 11:46:00 -0700 2017", "read_at": "Mon Mar 07 00:00:00 -0800 2011", "started_at": "Wed Jan 26 00:00:00 -0800 2011", "n_votes": 7, "n_comments": 0}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "18122", "review_id": "9a8c81912b6bf7f4091323a8093a94c8", "rating": 4, "review_text": "** spoiler alert ** \n I absolutely loved the first book, but didn't think the series finished as strong as I would have liked. \n Too many plot holes and things that didn't make sense. Maybe it was because it's supposed to be a children's book, but I didn't like things like how the harpies were so easily convince to change sides, how God's #2 is easily tricked by a little flirting, how Lyra & Will can suddenly easily lose their Daemons, and how two kids making love can save the universe. \n On the other hand the book did make you think, and I suppose religious ideas are probably best challenged in a children's book :) I did like the Dante's Inferno-esque description of the world of the dead, and Pullman's description of angels and their roles was brilliant. Also, the descriptions of how things evolved differently in different worlds was very interesting - particularly the Mulefa's world and the descriptions of the Gallivespians. I'm usually not a tragedy fan, but I did think Lyra & Will being separated at the end was a romantic and appropriate ending.", "date_added": "Wed Dec 26 17:21:26 -0800 2007", "date_updated": "Wed Mar 22 11:45:55 -0700 2017", "read_at": "Tue Jan 01 00:00:00 -0800 2008", "started_at": "", "n_votes": 0, "n_comments": 0}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "119322", "review_id": "111b958d9d8b5132be5e0c63399d1839", "rating": 5, "review_text": "Loved every second, and didn't want it to end, so I had to find a book store and buy the next two! Its a Harry Potter reading level and similar type fantasy story, but sometimes thats what you need on a long flight to NYC for the holidays! \n I think as a child we all daydreamed about alternate worlds, so I love how thats the basis for the book. Thinking about all the permutations of how things could turn out differently is kinda fun :) I think if I had a Daemon I would hope she'd settle on being a lynx.", "date_added": "Mon Dec 10 21:02:24 -0800 2007", "date_updated": "Wed Mar 22 11:45:52 -0700 2017", "read_at": "Sat Dec 01 00:00:00 -0800 2007", "started_at": "", "n_votes": 4, "n_comments": 2}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "52357", "review_id": "cd8f2fdfc17234b555ac662601f0e777", "rating": 3, "review_text": "I would hate to have to see the movie without having read it first...", "date_added": "Tue Sep 25 01:10:09 -0700 2007", "date_updated": "Wed Mar 22 11:35:19 -0700 2017", "read_at": "", "started_at": "", "n_votes": 0, "n_comments": 0}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "1022863", "review_id": "36aa8e00ce8032cba6afd6094550feae", "rating": 5, "review_text": "When people ask me what my favorite book is, Dune is always my answer. Words cannot even do justice to what an epic tale this is. We learn about spirituality, human nature, politics, religion, and the making of a hero. \n I loved the spiritual aspects of the book the best. The philosophies and practices and Pranu Bindu training of the Bene Gesserit that Paul learns and builds upon. The Bene Gesserit believe in a training regiment that results in a superior human being - one with every sense as refined as possible. This means a focus on learning, on controlling emotion, on controlling your body. \n My absolute favorite quote from Dune is the Bene Gesserit litany against fear: \n \"I must not fear. Fear is the mind-killer. Fear is the little-death that brings total obliteration. I will face my fear. I will permit it to pass over me and through me. And when it has gone past I will turn the inner eye to see its path. Where the fear has gone there will be nothing. Only I will remain.\" \n The litany is meant to be recited when you are in a moment of fear, and as I first read Dune 20 years ago, I've employed it many times. After Paul employs it when he is fighting Jamis, the affect on him is described as \"a cool bath washing over him. He felt muscles untie themselves, become poised and ready.\" I have read a lot about people who perform at high levels - whether it be in athletics or business, and success is all about getting into that zen state where you have a clear, focused mind. Fear is the biggest thing that can cloud one's mind - usually fear of failure, but there are other forms too. While this Litany won't always eliminate it, I've felt it to be useful to recognize the fear and call it out for what it is. \n There is also a focus in the book on being able to read people by paying attention to the minutia. In many crucial scenes we see Paul and Jessica and others employing this skill, using not only their eyes, but reading the tone of what a person says, what their body language or actions say, and more. Imagine the poker player I could be if I learned these skills! \n \"If you rely only on your eyes, your other senses weaken.\" \n It's interesting to me that so many science fiction novels contemplate a future with AI (aka post-singularity). In Dune, the Butlerian Jihad was the human rebellion to rid itself of AI or \"thinking machines\". They are now banned, and in their place we have Mentats, who are humans with processing powers far greater than any thinking machine. It's unclear to the software engineer in me how exactly that could be without some sort of physical manipulation (insertion of massive amounts of transistors, for instance), but the affect is pretty cool, we get Spock-esque beings who analyze everything extremely logically, and are great at political planning \"feints within feints within feints\". \n There was a lot in the book about leadership. It started with Paul first learning about it from his Father, and also from the Bene Gesserit. This quote stood out to me: \n \"She asked me to tell her what it is to rule,\" Paul said. \"And I said that one commands. And she said I had some unlearning to do.\" She hit a mark there right enough, Hawat thought. He nodded for Paul to continue. \"She said a ruler must learn to persuade and not to compel. She said he must lay the best coffee hearth to attract the finest men.\" \n Later as he grows into a leader himself, Paul learns that the most essential ingredient to be a leader is to lead people to a worthy goal. \n \"It was another of the essential ingredients that she felt her son needed: people with a goal. Such people would be easy to imbue with fervor and fanaticism. They could be wielded like a sword to win back Paul's place for him.\" \n Much has been made in modern reviews of Dune of the fact that it's clearly a statement about oil and the Middle East. The book even admits the Fremen are of Sunni descent, and many words they use (Jinn, Jihad, etc) are Arabic. I'm not sure I understand all the undertones, but one thing that was clear was about control of the worlds most precious commodity: \"The people who can destroy a thing, they control it.\" I hope we are closing in on the end of the days when oil controls so much, but we aren't there yet. In the meantime, we had best beware of any future Harkonnen's.", "date_added": "Tue Aug 29 11:45:04 -0700 2006", "date_updated": "Wed Jan 25 14:15:32 -0800 2017", "read_at": "Sat May 11 00:00:00 -0700 2013", "started_at": "Mon May 06 00:00:00 -0700 2013", "n_votes": 68, "n_comments": 14}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "6", "review_id": "d9f27b90095cd32ba1ec2a604e705e66", "rating": 5, "review_text": "This is the best harry potter book so far, followed closely by book 6.", "date_added": "Tue Aug 29 11:20:10 -0700 2006", "date_updated": "Wed Mar 22 11:44:11 -0700 2017", "read_at": "", "started_at": "", "n_votes": 4, "n_comments": 3}
{"user_id": "8842281e1d1347389f2ab93d60773d4d", "book_id": "2", "review_id": "85073a6ebd880836667f4414c8523012", "rating": 5, "review_text": "After the first read, this book is the worst one in the Harry Potter series. Characters are not as likeable as they are in the other books. However, I recently reread it (after reading book 6), and found it to be a very good read.", "date_added": "Tue Aug 29 11:20:05 -0700 2006", "date_updated": "Wed Mar 22 11:44:09 -0700 2017", "read_at": "", "started_at": "", "n_votes": 6, "n_comments": 2}
{"user_id": "72fb0d0087d28c832f15776b0d936598", "book_id": "15706923", "review_id": "6a870a66f732183b60214d57fa553093", "rating": 2, "review_text": "Ehhhhhh. \n Really nothing to rave about. It was not poorly written in terms of style or technical aspects. The story was not particularly interesting and I feel it is a bit overdone. It does not stand out from other vampire fiction to me. The \"romance\" happened far too quickly, in my opinion. I would expect vampires who have lived so long to be a little harder to get in the sack, but... Even for a short story, it was short. \n I feel like the author is capable of more. I would like to see a longer story from her. :)", "date_added": "Fri Nov 08 20:14:53 -0800 2013", "date_updated": "Fri Nov 08 20:16:50 -0800 2013", "read_at": "", "started_at": "", "n_votes": 0, "n_comments": 0}
{"user_id": "72fb0d0087d28c832f15776b0d936598", "book_id": "7840190", "review_id": "f73a70f64564d4a8f4cfb2d2e9d5836f", "rating": 4, "review_text": "Enjoyable read! I liked that Connie is not a typical cold-hearted, sexy, perfect, genius, vampire hunter. She's like a real person with flaws and weaknesses and fears. \n I really enjoyed the style of writing. I'm not usually a big fan of first person perspective, but I feel the author used a great balance of dialogue, descriptive text, and the character's \"voice\" really shone through without being too colloquial. \n Vampire fiction is a tricky subject these days as it's becoming so common, but I feel like this book was unique enough to stand out. I can't wait to read more!", "date_added": "Fri Nov 08 19:57:47 -0800 2013", "date_updated": "Fri Nov 08 20:01:41 -0800 2013", "read_at": "", "started_at": "", "n_votes": 0, "n_comments": 0}
{"user_id": "72fb0d0087d28c832f15776b0d936598", "book_id": "18306845", "review_id": "d4d57fb58be64655b0374ed864a7be40", "rating": 2, "review_text": "Keeping in mind I'm someone who has watched movies such as Martyrs and can watch/read crime scene details while keeping a straight head... \n This book was far too disturbing. Basically it felt like the authors wrote these stories merely for shock value. It included things like graphic cannibalism, sexually gratifying murder, pedophila, and extreme perversion all around. Particularly the stories by \"B.C Lawson\" disturbed me and made me wonder if he is actually a perverted serial killer. And who wants their work of fiction to create that worry... \n There were a few stories that stood out from the rest as actually quite well-written. As it's a collection, I can't paint all authors included with the same brush. But I feel it's almost unfortunate for those few authors who have talent and didn't just spew out filth to be included with the rest.", "date_added": "Wed Oct 30 11:00:12 -0700 2013", "date_updated": "Wed Oct 30 11:06:45 -0700 2013", "read_at": "Tue Jan 01 00:00:00 -0800 2013", "started_at": "", "n_votes": 0, "n_comments": 0}
{"user_id": "72fb0d0087d28c832f15776b0d936598", "book_id": "9577969", "review_id": "8c3b9a195db8930c2a05ae1c63033db8", "rating": 2, "review_text": "I have to be honest, not a fan of this book. It was not that the writing was poor, but it really did feel like a ploy to force religion down my throat. It's set up like a horror novella, but ends up feeling like a sermon. It felt very rushed to me. I did like the main character and feel there is potential, but I feel the author needs to explore either genre more fully; either religious fiction OR horror. Or, find a way to successfully cross over that fans of either genre would both enjoy.", "date_added": "Wed Oct 30 10:55:58 -0700 2013", "date_updated": "Wed Oct 30 10:58:18 -0700 2013", "read_at": "Sun Sep 01 00:00:00 -0700 2013", "started_at": "", "n_votes": 0, "n_comments": 0}
{"user_id": "f8a89075dc6de14857561522e729f82c", "book_id": "10782699", "review_id": "972ce1267de0213e3032c685386890e6", "rating": 5, "review_text": "I never thought I would enjoy a zombie books with a mix of romance. Amy wrote a beautiful book that is fast paced with a smooth transaction that leaves the reader not wanting to put the book down. This is not a \"eat brains\" type of zombie series. It is more about the lives of people who became undead and how they now live their lives with a mix of love. I wish I would have read this book much sooner, than waiting for over a year after adding the series to my ever growing book list.", "date_added": "Tue Oct 30 21:32:34 -0700 2012", "date_updated": "Fri May 02 09:20:56 -0700 2014", "read_at": "Thu May 01 00:00:00 -0700 2014", "started_at": "Tue Apr 29 00:00:00 -0700 2014", "n_votes": 0, "n_comments": 0}
{"user_id": "012515e5802b2e0f42915118c90fa04b", "book_id": "13206828", "review_id": "1d5b64fe0408bb5e1824d14631ccb5ee", "rating": 5, "review_text": "LET'S JUST SAY I AM SO THANKFUL I HAVE THE NEXT BOOK BESIDE ME", "date_added": "Sat Sep 23 08:39:21 -0700 2017", "date_updated": "Sat Sep 30 11:30:46 -0700 2017", "read_at": "Thu Sep 28 16:51:17 -0700 2017", "started_at": "Sun Sep 24 00:00:00 -0700 2017", "n_votes": 0, "n_comments": 0}
{"user_id": "012515e5802b2e0f42915118c90fa04b", "book_id": "13206900", "review_id": "9de8dc1b8fa869233251e2a6eb783552", "rating": 4, "review_text": "I can't believe it's over dY~C/", "date_added": "Sat Sep 23 08:39:03 -0700 2017", "date_updated": "Sat Oct 07 18:02:29 -0700 2017", "read_at": "Sat Oct 07 00:00:00 -0700 2017", "started_at": "Thu Sep 28 00:00:00 -0700 2017", "n_votes": 0, "n_comments": 0}
{"user_id": "012515e5802b2e0f42915118c90fa04b", "book_id": "13206760", "review_id": "1fc0c08b3224b734b51996989ce52344", "rating": 5, "review_text": "I didn't know if I would enjoy the book being so focussed on new characters, but MAN it was done so well", "date_added": "Wed Sep 20 04:51:35 -0700 2017", "date_updated": "Sat Sep 30 11:30:43 -0700 2017", "read_at": "Sun Sep 24 14:08:38 -0700 2017", "started_at": "Thu Sep 21 00:00:00 -0700 2017", "n_votes": 0, "n_comments": 0}
{"user_id": "012515e5802b2e0f42915118c90fa04b", "book_id": "29275562", "review_id": "69539632d9918511b948fa18c87d48a4", "rating": 5, "review_text": "I liked it much more than the first one to be honest. And the ending had me emotional - when I didn't think I would be. Pretty good book :)", "date_added": "Sat Aug 26 20:20:14 -0700 2017", "date_updated": "Sat Sep 30 11:31:47 -0700 2017", "read_at": "Tue Sep 05 00:00:00 -0700 2017", "started_at": "Fri Sep 01 00:00:00 -0700 2017", "n_votes": 0, "n_comments": 0}
{"user_id": "012515e5802b2e0f42915118c90fa04b", "book_id": "25174926", "review_id": "5b3aac1958a1db10b48da6e6e529ec7f", "rating": 5, "review_text": "Such a good end and wrap-up to such a loved series. I waited for four years for this book. I was not disappointed. And I may seriously never get tired of Gabriel", "date_added": "Sat Nov 26 13:55:37 -0800 2016", "date_updated": "Sat Sep 30 11:30:56 -0700 2017", "read_at": "Thu Aug 31 00:00:00 -0700 2017", "started_at": "Tue Aug 29 00:00:00 -0700 2017", "n_votes": 0, "n_comments": 0}
{"user_id": "012515e5802b2e0f42915118c90fa04b", "book_id": "3227063", "review_id": "624e11e52283ad514e3d16d197949233", "rating": 4, "review_text": "WELL THAT WAS AN INTERESTING EPILOGUE", "date_added": "Mon Dec 14 19:44:45 -0800 2015", "date_updated": "Sun Jan 10 14:14:10 -0800 2016", "read_at": "Sun Jan 10 14:14:10 -0800 2016", "started_at": "Sun Dec 27 00:00:00 -0800 2015", "n_votes": 2, "n_comments": 0}
{"user_id": "012515e5802b2e0f42915118c90fa04b", "book_id": "25174916", "review_id": "066fdaff37947953750a8b1407afe48f", "rating": 5, "review_text": "Okay so can I just say I finished this book in two weekdays, while working and being a full time engineering student. that's how much it gripped me \n So good. And I ship it so much. But also.... More paranormal Focus again please... It feels like it's kinda getting lost(decision wise... Was any progress actually made?) \n Also REALLY glad it didn't end on a cliffhanger. It was a nice end :) hopefully it can last me another year \n All I know is - please get me the next book. And quick", "date_added": "Mon Sep 07 20:10:28 -0700 2015", "date_updated": "Sat Sep 30 11:31:37 -0700 2017", "read_at": "Fri Nov 25 00:00:00 -0800 2016", "started_at": "Thu Nov 24 00:00:00 -0800 2016", "n_votes": 3, "n_comments": 0}
{"user_id": "012515e5802b2e0f42915118c90fa04b", "book_id": "2802316", "review_id": "c4c2068c9e87c2f9f51cabb5c09163ee", "rating": 4, "review_text": "I literally cannot deal with my heart right now", "date_added": "Sun Apr 26 11:20:17 -0700 2015", "date_updated": "Wed Dec 16 18:55:00 -0800 2015", "read_at": "Tue Apr 28 00:00:00 -0700 2015", "started_at": "", "n_votes": 0, "n_comments": 0}
{"user_id": "012515e5802b2e0f42915118c90fa04b", "book_id": "15747422", "review_id": "83dbad99ee78d0c40ab49c7ff55fec97", "rating": 3, "review_text": "That ending... I thought there would be another chapter, not the end of the book!", "date_added": "Mon Dec 22 11:13:10 -0800 2014", "date_updated": "Tue Dec 15 19:39:32 -0800 2015", "read_at": "Thu Dec 25 16:31:54 -0800 2014", "started_at": "Mon Dec 22 00:00:00 -0800 2014", "n_votes": 0, "n_comments": 0}
{"user_id": "012515e5802b2e0f42915118c90fa04b", "book_id": "23006161", "review_id": "6ab630bacdb2452c062bc814256bc2f9", "rating": 4, "review_text": "ARGH. \n Literally. I thought this would be the book where it would F.I.N.A.L.L.Y. happen but nope! \n I'm gonna to punch a wall. A brick wall. With lots of bricks. \n This book kinda overplayed the whole triangle. And Gabriel... I get Armstrong is making subtle moves with him as it is his character but really 3 books?!? I was happy with it lasting one, even two, but three is kinda pushing it. \n But man I'm instead to see how see plays the next two books I just wish I didn't have to wait for them D: \n BUT MY SHIPPPPPPPPPPPPPPPPPPPPPPPPP", "date_added": "Mon Dec 08 16:42:30 -0800 2014", "date_updated": "Tue Dec 15 19:38:05 -0800 2015", "read_at": "Sun Sep 06 19:57:05 -0700 2015", "started_at": "Sun Sep 06 00:00:00 -0700 2015", "n_votes": 2, "n_comments": 2}
{"user_id": "012515e5802b2e0f42915118c90fa04b", "book_id": "9462815", "review_id": "a99a5a35d2592795791ebe3e49c57b99", "rating": 2, "review_text": "Wow I lost it on the last page. Yay for happy crying", "date_added": "Sat Nov 08 08:59:14 -0800 2014", "date_updated": "Wed Dec 16 18:54:40 -0800 2015", "read_at": "Mon Nov 10 12:46:36 -0800 2014", "started_at": "Sat Nov 08 00:00:00 -0800 2014", "n_votes": 0, "n_comments": 0}
{"user_id": "012515e5802b2e0f42915118c90fa04b", "book_id": "18398797", "review_id": "ee2da3f18a9d036cd1b67d182daf9072", "rating": 4, "review_text": "Gabriel. I mean I love the way this story is. No love at first sight, slow, but stringing us along in the romance department, and a strong female lead who can be stupid at times, but is still pretty great. \n But Gabriel. If you don't like anything else about this series read it for Gabriel. He's my favourite character by far, and just the way he's developed and the more you learn about him... ugh. \n (I'M ROOTING FOR THIS ROMANCE AND I SHALL NEVER STOP, but I love the fact it's been 2 books and is still slowly developing; its so different than so many other books coming out lately) \n But seriously.. Next book please (I couldibihg barely survive a weeks wait for visions how can I last a year for the next?)", "date_added": "Tue Aug 19 11:03:41 -0700 2014", "date_updated": "Tue Dec 15 19:38:47 -0800 2015", "read_at": "Thu Aug 28 00:00:00 -0700 2014", "started_at": "Wed Aug 27 00:00:00 -0700 2014", "n_votes": 0, "n_comments": 0}
{"user_id": "012515e5802b2e0f42915118c90fa04b", "book_id": "17331295", "review_id": "899ba09ca35a6447324d64be3a5fcf5a", "rating": 4, "review_text": "It really should've ended with more.. Action. That's all I'm saying", "date_added": "Fri Aug 08 20:22:21 -0700 2014", "date_updated": "Thu Aug 28 14:57:23 -0700 2014", "read_at": "Sat Aug 09 00:00:00 -0700 2014", "started_at": "", "n_votes": 0, "n_comments": 0}
{"user_id": "012515e5802b2e0f42915118c90fa04b", "book_id": "13188676", "review_id": "540daa321648be66f867791b5a1aa85f", "rating": 5, "review_text": "I CANT EVEN EXPRESS MY EMOTIONS OH GEEZ I LOVE THE ENDING IM CRYING OH WARNER", "date_added": "Tue Feb 04 19:05:36 -0800 2014", "date_updated": "Mon Feb 17 16:46:11 -0800 2014", "read_at": "Fri Feb 07 22:22:17 -0800 2014", "started_at": "Fri Feb 07 00:00:00 -0800 2014", "n_votes": 0, "n_comments": 0}
{"user_id": "012515e5802b2e0f42915118c90fa04b", "book_id": "13623150", "review_id": "70ebc0d4940def9bbaa54c029bb2b8a0", "rating": 5, "review_text": "Oh Warner...", "date_added": "Tue Feb 04 11:17:42 -0800 2014", "date_updated": "Tue Feb 04 18:47:15 -0800 2014", "read_at": "Tue Feb 04 00:00:00 -0800 2014", "started_at": "Tue Feb 04 00:00:00 -0800 2014", "n_votes": 0, "n_comments": 0}
{"user_id": "012515e5802b2e0f42915118c90fa04b", "book_id": "13104080", "review_id": "528000001d6705f260ac8c7a58327018", "rating": 5, "review_text": "Warner. I need more Warner this second. That's all.", "date_added": "Tue Feb 04 11:16:40 -0800 2014", "date_updated": "Fri Feb 07 12:17:31 -0800 2014", "read_at": "Fri Feb 07 12:17:31 -0800 2014", "started_at": "Thu Feb 06 00:00:00 -0800 2014", "n_votes": 0, "n_comments": 0}
{"user_id": "012515e5802b2e0f42915118c90fa04b", "book_id": "13508069", "review_id": "5b12c5a78b6c7d41c601555bbf8a088f", "rating": 5, "review_text": "I just... I can't. I completely can't. \n Those last 10 pages I was bawling. Bawling my eyes out. Let's just say I got the pages wet... But Kaylee went through hell, literal hell, and she FINALLY got her happy ending and I cannot be happier. \n Kaylee and Tod... and Nash... and everyone... You dang well deserve your happy ending.", "date_added": "Sun Jan 05 10:58:13 -0800 2014", "date_updated": "Thu Jan 09 14:37:21 -0800 2014", "read_at": "Thu Jan 09 14:37:21 -0800 2014", "started_at": "Wed Jan 08 00:00:00 -0800 2014", "n_votes": 1, "n_comments": 0}
{"user_id": "012515e5802b2e0f42915118c90fa04b", "book_id": "8803932", "review_id": "21c41d209d0e13c55a73c5208f11f952", "rating": 5, "review_text": "When I read that ending I was crying, then shaking, then screaming, failing, in shock, I'm more shock, and then I died a death of extreme happiness... I can't believe that all happened and In what, less than 5 pages? \n I'm still shaking.", "date_added": "Sat Jan 04 17:14:18 -0800 2014", "date_updated": "Sat Jan 04 18:24:10 -0800 2014", "read_at": "Sat Jan 04 00:00:00 -0800 2014", "started_at": "Sat Jan 04 00:00:00 -0800 2014", "n_votes": 1, "n_comments": 0}
{"user_id": "012515e5802b2e0f42915118c90fa04b", "book_id": "11454587", "review_id": "b3881c3c1c9e0993e5d4f14971d914ac", "rating": 5, "review_text": "Sigh. Archer. I love you so much.", "date_added": "Mon Dec 02 18:31:04 -0800 2013", "date_updated": "Tue Dec 03 17:12:05 -0800 2013", "read_at": "Tue Dec 03 00:00:00 -0800 2013", "started_at": "Mon Dec 02 00:00:00 -0800 2013", "n_votes": 0, "n_comments": 0}
{"user_id": "012515e5802b2e0f42915118c90fa04b", "book_id": "8428064", "review_id": "e7f30678c2914943337b694c79139361", "rating": 5, "review_text": "I can't.", "date_added": "Sat Nov 30 23:45:41 -0800 2013", "date_updated": "Wed Dec 16 18:49:59 -0800 2015", "read_at": "Mon Dec 02 00:00:00 -0800 2013", "started_at": "", "n_votes": 0, "n_comments": 0}
{"user_id": "012515e5802b2e0f42915118c90fa04b", "book_id": "10429045", "review_id": "642d0b0449fb10ab6832364aae7b65f9", "rating": 5, "review_text": "This book was really good! Like, it went by super fast and before I knew it I was at the last 10 pages already... I literally wasn't bored for a minute. \n Only thing that bugged me was there was a lot of metaphors that drove me crazy something like JUST SAY WHAT YOURE TRYING TO SAY. \n But it was amazing... I love Adam and I don't want to love Warner but I definitely feel like it's gonna happen... \n Be warned, you'll pretty much want to read this is one sitting", "date_added": "Sun Mar 10 22:30:31 -0700 2013", "date_updated": "Tue Feb 04 11:28:01 -0800 2014", "read_at": "Tue Feb 04 11:28:01 -0800 2014", "started_at": "Tue Feb 04 00:00:00 -0800 2014", "n_votes": 0, "n_comments": 0}
{"user_id": "012515e5802b2e0f42915118c90fa04b", "book_id": "15861491", "review_id": "6902b0e48c7e0e2c622dbacf9f598d2e", "rating": 4, "review_text": "Can I just say... Those last like 20 pages were full of twists and turns like I'm still not sure what just happened...", "date_added": "Mon Feb 11 14:15:29 -0800 2013", "date_updated": "Mon Sep 30 20:05:09 -0700 2013", "read_at": "Mon Sep 30 00:00:00 -0700 2013", "started_at": "Fri Sep 27 00:00:00 -0700 2013", "n_votes": 0, "n_comments": 0}
{"user_id": "012515e5802b2e0f42915118c90fa04b", "book_id": "15745371", "review_id": "f02fa7174c65a1c43d52e16b8d244cc8", "rating": 5, "review_text": "OMG. SO. I totally thought taken at dusk was the end.... THEN WHISPERS AT MOONRISE APPEARED. AND OMG I JUST FINISHED IT AND I LEARN, THERES A FIFTH, CHOSEN AT NIGHTFALL. \n FINALE. OMG I CANT BELIEVE THE SERIES IS GONNA END.... THIS BOOK BETTER BE A-M-A-Z-I-N-G. \n And is it just me or is she brunette now? \n And Kylie... PICK LUCAS. OR DEREK.... I LOVE LUCAS BUT DEREKS PROBABLY BETTER.. \n ...Brunett better be in this book or I will cry. Literally. \n APRIL 30TH COME FASTERRRRRRRRRRRRR.", "date_added": "Thu Dec 27 02:30:06 -0800 2012", "date_updated": "Tue Aug 20 16:22:11 -0700 2013", "read_at": "Sun Jun 09 14:00:16 -0700 2013", "started_at": "Wed Jun 05 00:00:00 -0700 2013", "n_votes": 1, "n_comments": 0}
{"user_id": "012515e5802b2e0f42915118c90fa04b", "book_id": "7791997", "review_id": "c9a66d31a94b44c73ba67a88870d5e45", "rating": 4, "review_text": "This book is amazing...... Its so confusing at times but trust me, so worth the read :)", "date_added": "Mon Oct 01 16:01:24 -0700 2012", "date_updated": "Wed Dec 16 18:59:24 -0800 2015", "read_at": "", "started_at": "", "n_votes": 0, "n_comments": 0}
{"user_id": "012515e5802b2e0f42915118c90fa04b", "book_id": "11563110", "review_id": "3a0875329475be058a7e6603ae11dc08", "rating": 5, "review_text": "Still a sucker for romance", "date_added": "Mon Sep 17 13:41:09 -0700 2012", "date_updated": "Sat Sep 30 11:35:51 -0700 2017", "read_at": "Thu Sep 20 00:00:00 -0700 2012", "started_at": "", "n_votes": 0, "n_comments": 0}
{"user_id": "012515e5802b2e0f42915118c90fa04b", "book_id": "5287473", "review_id": "036b9c7000bb1048147381721a660ba8", "rating": 5, "review_text": "I recommend this to everyone. \n No seriously \n Go read it \n Now", "date_added": "Thu Jun 07 13:06:53 -0700 2012", "date_updated": "Sat Jan 25 17:01:24 -0800 2014", "read_at": "Sun Dec 01 00:00:00 -0800 2013", "started_at": "", "n_votes": 0, "n_comments": 7}
{"user_id": "012515e5802b2e0f42915118c90fa04b", "book_id": "6581511", "review_id": "45caf2d13f9c4ad4dbcf929a4242d8a9", "rating": 2, "review_text": "AHHHHH ENDING WAS SO UNEXPECTED D: for me at least.... :) basically durning whole book i was on the edge of my seat, just wondering what would happen next! i think its the best out of the series :)", "date_added": "Mon Jun 04 19:50:04 -0700 2012", "date_updated": "Sun Aug 03 12:04:01 -0700 2014", "read_at": "Mon Jun 11 16:31:16 -0700 2012", "started_at": "Mon Jun 04 00:00:00 -0700 2012", "n_votes": 0, "n_comments": 0}
{"user_id": "012515e5802b2e0f42915118c90fa04b", "book_id": "11864728", "review_id": "30ac79a151c1544ab7fdb1cc2dcf27de", "rating": 5, "review_text": "OMG..... i loved darkest powers... felt it ended to soon \n then i heard bout the darkness rising, and heard something bout chloe and friends being in it.... \n so i read the gathering..... and got majorly disappointed. \n then, the day the calling came out i read it.... IT WAS WAY BETTER. AND OMG THE ENDING. THE ENDING. I WAS JUST DYING WHEN I WAS READING BOUT THE REFERENCES TO CHLOE AND THEM.... \n I CANT WAIT A YEAR. \n CHloe and Derek <3 i missed u Dx \n All i know is...... the day it comes out im gonna buy it ASAP and stay up all night reading... especially considering it comes out right before my birthday! <3 \n i think im gonna just cy and curl up into a ball when its over tho D:", "date_added": "Mon Jun 04 19:49:01 -0700 2012", "date_updated": "Tue Aug 20 15:20:50 -0700 2013", "read_at": "Thu Apr 11 00:00:00 -0700 2013", "started_at": "", "n_votes": 4, "n_comments": 0}
{"user_id": "012515e5802b2e0f42915118c90fa04b", "book_id": "2998814", "review_id": "5d7049d54bfd0d138529f3c70e5ef482", "rating": 2, "review_text": "Well... i found this book mostly really boring. \n i found that i liked the romance in the beginning...then i found it getting kinda old, how thats ALL she'll think about. Also, i found there was barely any action in this book... i dont get the obsession some people have with this book xD Nothing interesting appened till the last 50 pages and then it ended before w barely knew anything xD \n I give it like 2.5 stars... :) Also, if you read this book i say get the next one too... i guess im interested enough to read the next to find out what happens :)", "date_added": "Mon Jun 04 19:46:15 -0700 2012", "date_updated": "Wed Dec 16 18:51:53 -0800 2015", "read_at": "Tue Jun 05 00:00:00 -0700 2012", "started_at": "Mon Jun 04 00:00:00 -0700 2012", "n_votes": 0, "n_comments": 0}
{"user_id": "012515e5802b2e0f42915118c90fa04b", "book_id": "13416236", "review_id": "9d373d0e4a80bc974562ed6e672dbf7f", "rating": 5, "review_text": "OMG I CANT. \n LETS JUST SAY..... \n I \n HATE \n CLIFFHANGERS. \n AND KYLIE... WHY!?!? THE BOOKS WILL NEVER BE AS GOOD ANYMORE!! I THINK.......... I HOPE IM WRONG.... \n AND LUCAS.. I CANT.. \n I don't know why but i love him more than Derek.... BUT LUCAS NOW I JUST WANNA PUNCH YOUR FACE OUT. LIKE DO THAT THEN JUST LEAVE AND NOT SAY GOODBYE? ARGH. EMOTIONS. \n ANYWAYS... this book was so good compared to the other books... I felt the beginnning was kinda slow... but as you got reading and so many new thing that you didn't expect were thrown at you.... YOU GET SO INTO IT. \n THE ENDING I LITERALLY CRIED. CRIED. \n AND FINALLY.... let just say i LOVE burnett! we're talking fav character here!!", "date_added": "Mon Jun 04 19:40:40 -0700 2012", "date_updated": "Tue Aug 20 15:22:51 -0700 2013", "read_at": "Mon Oct 01 00:00:00 -0700 2012", "started_at": "", "n_votes": 0, "n_comments": 0}
{"user_id": "012515e5802b2e0f42915118c90fa04b", "book_id": "10863148", "review_id": "f8f57c14551a636c345b104512dec35f", "rating": 5, "review_text": "Seriouly sad this is the last book :( but i cant wait <3 i LOVE kelley armstrong's books, shes so talented :) kinda sad the last book froms Savannah's view, but oh well:)", "date_added": "Mon Jun 04 19:17:30 -0700 2012", "date_updated": "Tue Aug 20 15:23:28 -0700 2013", "read_at": "Sun Jul 01 00:00:00 -0700 2012", "started_at": "", "n_votes": 4, "n_comments": 0}
{"user_id": "012515e5802b2e0f42915118c90fa04b", "book_id": "10799881", "review_id": "8e1ec3460ce09ab05bee519165073874", "rating": 4, "review_text": "Soooo good and NOT a disappointment from the first book! but it makes u want to read the next one SOOOO bad ;) AMAZING :)", "date_added": "Mon Jun 04 19:08:00 -0700 2012", "date_updated": "Wed Dec 16 18:59:23 -0800 2015", "read_at": "Tue May 01 00:00:00 -0700 2012", "started_at": "", "n_votes": 0, "n_comments": 0}
{"user_id": "012515e5802b2e0f42915118c90fa04b", "book_id": "11765920", "review_id": "f98b9fbfe3ba2daf35ec1960d25056a8", "rating": 4, "review_text": "Well... first off Kelley Armstrong is my FAVOURITE AUTHOR EVER.... ALLL her books are AMAZING.. especially DP and WOTOW \n Secondly.... this book was too... how do I put it? happy endingyish... I mean the ending, cmon, after everything, THAT?!?! Gosh.. \n Third.. I never liked DR too too much but I was really excited for the rising, for chloe and cuz I liked the series, I don't know. But this book honestly wasn't too good... I didn't like the cabals and how they were (WOTOW so much better), the choices (like wut?), and just the ending! \n Fourth, DEREK AND CHLOE WERE COMPLETELY THE BEST PART... but how do I put this.. they seemed really different from DP and I mean I kinda get it but it kinda ruined it for me... \n So.. this book was good, and as much as I want more... more would ruin the whole storyline for me... I think this one was just on the edge:) \n OH AND I LOVED THE CONNECTIONS TO WOTOW, AT EVERYONE I WAS JUMPING UP AND DOWN", "date_added": "Mon Jun 04 19:07:46 -0700 2012", "date_updated": "Wed May 15 19:30:53 -0700 2013", "read_at": "Tue Apr 10 00:00:00 -0700 2012", "started_at": "", "n_votes": 1, "n_comments": 0}
{"user_id": "012515e5802b2e0f42915118c90fa04b", "book_id": "2800905", "review_id": "5de55db61bf97442ffe5b53ee65e2068", "rating": 5, "review_text": "I read this book almost 3 years ago and it's still my favourite book ever. Ever. \n I re-read it time and time again and fall in love every time.... Derek please let me marry you. \n I seriously recommend this book, it's different, amazing, and the series will take you on a journey. \n Kelley Armstrong is a genius, and if you've read the Women of the Otherworld series you'll notice subtle links between the two that get bigger as the series progresses, setting the 3 series (Including Darkest Rising) in the same universe, which makes it a more enjoyable and wonderful experience to fans of Kelley Armstrong's work..... \n Ignore my rambling and seriously pick up this book. \n You won't regret it", "date_added": "Mon Jun 04 19:05:23 -0700 2012", "date_updated": "Tue Feb 04 18:57:42 -0800 2014", "read_at": "Fri Apr 01 00:00:00 -0700 2011", "started_at": "", "n_votes": 0, "n_comments": 0}
{"user_id": "f4d16ea4ac59af59d257631398af39f4", "book_id": "7304203", "review_id": "300503e2045dfa99d989ea91f79045d2", "rating": 5, "review_text": "I can't help but squeal with amazement after reading this series. It was dangerously sexy, thrilling, and pure fun. It made me (and still tempts me) to catch a plane to Dublin and study abroad. So. so. amazing.", "date_added": "Wed Aug 08 21:42:07 -0700 2012", "date_updated": "Sat Sep 01 19:27:03 -0700 2012", "read_at": "", "started_at": "", "n_votes": 0, "n_comments": 0}
{"user_id": "f4d16ea4ac59af59d257631398af39f4", "book_id": "9918133", "review_id": "3755a2cc215e155fdf77a0a98782e723", "rating": 2, "review_text": "*CONTAINS SPOILERS* \n I would probably rate this book 1.5 stars out of 5 JUST because of its intense and creepy ass ending. I really did not enjoy how slow this book was until the last 80 pages or so. Amazingly, I got through it after putting this book down several times. \n I've got to admit, I was drawn by the cover. It sounded pretty interesting, but I should've read a couple of pages in before renting it out at the library (glad I didn't pay for this book) because I totally did not know it was set in a high school setting. Blah! I hate those kinds of settings, but that's just my preference. \n As for the plot... Sheesh! Was it really necessary for things to turn out like they did? I was shocked.. What kind of karma is that?! Hell, it really was unfair. I felt that it was a bit.. no, not even.. WAY too cruel for consequences. \n The main character, Em, was pretty relatable which I liked a lot. She wasn't annoying; thank god! The other characters, not-so-likeable. They were quite bland when it came to being a complex character. Chase was just, wow, amazingly arrogant and totally irresponsible. A complete jerk who wouldn't be liable for any of his actions and swathed by the words or beauty of a Fury. Ergh, he had no backbone and I hated that. I enjoyed how Em turned out at the ending of the story and what she went through was PRETTY dang creepy. As I said, I loved the end but I definitely hated having to wait 300 pages until the story got interesting. \n *END RANT* :L", "date_added": "Tue Aug 07 22:54:38 -0700 2012", "date_updated": "Wed Aug 08 23:19:09 -0700 2012", "read_at": "Wed Aug 08 00:00:00 -0700 2012", "started_at": "Tue Aug 07 00:00:00 -0700 2012", "n_votes": 0, "n_comments": 0}
{"user_id": "f4d16ea4ac59af59d257631398af39f4", "book_id": "13480769", "review_id": "fb2c724469c28fa50dd02716502fe8bc", "rating": 5, "review_text": "Amazing!! Higginson is now one of my most admired authors. Her extraordinary and captivating imagination portrayed in this book rendered me speechless and at awe. I was a bit hesitant to read this series, but after reading the first book of the series I fell in love with it. I guarantee that you will not be disappointed by reading this series. It was an incredibly written series that was well tied with explanations and beautiful details of the settings. The main characters were dymamic and complex which made the series highly interesting. Purely magical.", "date_added": "Fri Jul 06 15:41:44 -0700 2012", "date_updated": "Fri Jul 06 15:52:43 -0700 2012", "read_at": "Fri Jul 06 15:52:43 -0700 2012", "started_at": "", "n_votes": 0, "n_comments": 0}
{"user_id": "f4d16ea4ac59af59d257631398af39f4", "book_id": "8755776", "review_id": "a72520c7d55631c92d1248f2b45b2421", "rating": 3, "review_text": "I was pretty excited for this one but unfortunately... I was pretty disappointed. \n The only part of the book that was interesting for me was the last 100 pages (Nook eBook edition); but that's just me. There were a lot of things going on but it wasn't as intensely mind-blowing like the other books in this series. Unlike the other books in this series (where I was hooked from the beginning to the end) I was struggling to actually finish this book until I reached those last 100 pages. I will admit that I enjoyed how she ended this book and I loved how she made readers think hard about Sebastian and his truthful plans. Besides that, I don't think I gained any new insight to any of the characters besides Simon's way of thinking when it comes to relationships. \n I simply \"liked\" this book, rather than \"loved\" it and it pains me to say it because I love this series. Either way, I still love this series and will read the next :)", "date_added": "Mon Jun 04 19:09:19 -0700 2012", "date_updated": "Thu Jul 12 16:18:54 -0700 2012", "read_at": "Tue Jul 10 00:00:00 -0700 2012", "started_at": "Sat Jul 07 00:00:00 -0700 2012", "n_votes": 0, "n_comments": 0}
{"user_id": "01ec1a320ffded6b2dd47833f2c8e4fb", "book_id": "34853896", "review_id": "fde7e3e91c35ce9d5194153e2cad0731", "rating": 5, "review_text": "\"You smile like the devil,\" Mona said. \n \"The devil doesn't smile,\" he said. \"The devil smirks.\" \n STUNNING!! Ms. Reisz proves once again she is the Queen of erotica. The story and characters are all richly drawn and unforgettable. Mona Lisa St. James made a promise to her mother that she would do anything at all to save their art gallery. But the gallery is in financial trouble and she must sell it. And soon. \n But then a handsome Englishman arrives and makes her an irresistible offer. He will save her gallery. But she must agree to be his for one year. \n \"You were meant to do this,\" he said softly. \"You'll see.\" \n \"Why me?\" she asked. \"Millions of women in this country, millions in yours...why me?\" \n \"Millions of paintings in this world. Only one Mona Lisa. Billions of women in this world. Only one you, Mona Lisa St. James.\" \n And so begins the most erotic and sensual adventures Mona has ever had. A sexual awakening of sorts, Mona and the mysterious Malcolm shares his most erotic and depraved fantasies. Yet each and every encounter is sexy and beautiful and simply stunning!! Malcolm is judgement-free and slowly begins to understand her true nature and what life has in store for her. \n I can't even begin to describe how incredibly sensual and hot the scenes between Mona and Malcolm are. Each of their encounters is a wild and delightful fantasy, interwoven with mythology, history and lush eroticism. \n \"Is this all a dream?\" That's the only thing that makes any sense. \n \"You aren't dreaming,\" he said, and she knew that was true. She was awake and had been every time they had met. \"But if you were a dream, would you want to wake up?\" he asked. \n A good question. A fair question. A hard question, but one she answered easily. \n \"Never.\" \n I absolutely loved the conclusion to this gorgeous story. It was surprising and thrilling and completely satisfying! I fell in love with the rakish Malcolm. This book is unlike anything I've ever read. Tiffany Reisz writes with sensuality and skill. 'The Red' is a must-read for all erotic romance lovers!! \n \"Do anything you must, but keep me forever.\" \n (With many thanks to the author for a review copy.)", "date_added": "Fri Apr 14 22:21:41 -0700 2017", "date_updated": "Sun Jul 16 09:04:24 -0700 2017", "read_at": "Wed Jul 12 16:30:30 -0700 2017", "started_at": "Mon Jul 10 00:00:00 -0700 2017", "n_votes": 21, "n_comments": 0}
{"user_id": "01ec1a320ffded6b2dd47833f2c8e4fb", "book_id": "34947450", "review_id": "c3a04a9c538d0f885138af71d0ce9475", "rating": 5, "review_text": "4.5 - 5 GORGEOUS STARS \n \"No rules. Live out loud. Find the sunshine.\" \n Simply stunning!! Emma Scott writes THE most lyrical and gorgeous fiction. Nik and Fiona have a permanent place in my heart! \n Called a contemporary romance \"with paranormal elements,\" I found this book to be incredibly moving and very, very touching. I would not exactly characterize the story as paranormal but more the tale of a deeply empathetic man who is simply searching for love and acceptance. And please don't be put off by this being the second book in a series. I have not read the first book and I absolutely fell in love with these characters and the plot. This book is a total standalone! \n Nik and Fiona are both lost and simply wishing for a better life. For Nik, he only wants to silence the cacophony of sounds and colors he sees and for Fiona, it is the hope of a new life in Costa Rica. And when they meet, it is pure magic. \n \"But it wasn't what was wrong with me, anymore. It was what was right. The girl exuded a calm that danced along my skin, and when I inhaled, it was like breathing in the scent of something delicious but far away. The thrumming life all around me grew quiet. For the first time, I felt close to peace, and I wanted more.\" \n What begins as a one-night stand with zero expectations for the future turns into a burning hot love and a deep, unbreakable connection. Emma Scott's love scenes are beautiful and SEXY and a joy to read! \n \"Nikolai Alexei,\" she whispered and cupped my cheeks to look at me in the dimness. \"Who are you?\" \n There are very important messages in this book as well as some very gritty and heartbreaking scenes. But ultimately the message is one of hope and acceptance and unconditional love. Once again, I won't soon forget the characters created by Emma Scott. A must-read! \n \"Love and hope,\" she said. \"That's life to me.\" \n (ARC provided by the author in return for an honest review.)", "date_added": "Fri Mar 10 14:12:38 -0800 2017", "date_updated": "Thu Aug 17 04:19:19 -0700 2017", "read_at": "Mon Jun 12 16:12:21 -0700 2017", "started_at": "Thu Jun 08 11:10:56 -0700 2017", "n_votes": 16, "n_comments": 0}
{"user_id": "01ec1a320ffded6b2dd47833f2c8e4fb", "book_id": "30853358", "review_id": "df88cbef0006a011814742c5a82cb97f", "rating": 5, "review_text": "4.5 - 5 Stars!! \n \"It's always the ones who are the quietest who often have the greatest things to say. And yes, I think we'll be friends.\" \n Simple, beautiful and unforgettable, 'Wolfsong' was one of the most gripping books I've read all year. Never in a million years did I think I would love a book about werewolves with a little fantasy sprinkled in but this book and this writing is just gorgeous. If you want to take a chance an read something that is a little outside your comfort zone, read this book!! I will never forget the great Ox and the entire Bennett family. \n A story about love, devotion, loyalty, friendship and family, 'Wolfsong' was also one of the most stunning love stories I've ever read. Ox, a kind, lovely soul, lives in a small town and lives a very quiet life with his mother. Until he meets Joe, and then his whole world is turned upside down. \n \"Words. Words were my enemy. How to say that here was where I felt the safest. Here was where I felt most at home. Here was where I wouldn't be judged. I wasn't a fucking retard here. I wasn't a waste of space or time. I wanted to say so much, too much, and found I couldn't really say anything at all.\" \n I highlighted so much of this epic story that my entire review could be made of quotes from this extraordinary book! Every character, every scene felt necessary and breathtaking. The bonds between Ox, Joe and the Bennett family seemed unbreakable and I was on the edge of my seat waiting to see where this amazing author would take, me. This book is quite a journey and I loved every single minute. \n \"It was not a gradual thing. Wait. That was a lie. I didn't know it was a gradual thing. But it must have been. It had to have been. Because it's the only thing that explained the cosmic explosion that was the feeling of want and need and mine mine mine. The force of it was ridiculous. It had to have been there. For a long time.\" \n Fantasy books are usually not my thing but this book completely grabbed me from the first page. I felt as if I knew each of these characters. I wanted to wrap my arms around Ox and give him a big hug. These characters literally came to life before my eyes! I became entranced by the Oregon setting and the Bennett clan. I only wanted Ox and Joe to have their happy ending because they both deserved it so, so much. \n \"I would do anything to make you happy because no one had ever smelled like you did. It was candy canes and pinecones. It was epic and awesome. And it was home. You smelled like my home, Ox.\" \n I don't want to go into detail about the plot because it was surprising and thrilling. Take a chance on 'Wolfsong' and read this book! It was simply glorious. Definitely one of those books that would make a fantastic movie. \n \"It's easy to get lost, Ox, because the world is a wide and scary place. And every now and then, you just have to be reminded of the way home.\"", "date_added": "Fri Dec 16 15:37:36 -0800 2016", "date_updated": "Thu Dec 29 07:05:21 -0800 2016", "read_at": "Wed Dec 28 00:00:00 -0800 2016", "started_at": "Mon Dec 26 00:00:00 -0800 2016", "n_votes": 12, "n_comments": 0}
{"user_id": "01ec1a320ffded6b2dd47833f2c8e4fb", "book_id": "32027348", "review_id": "31955639c84959473e0d62d663824e27", "rating": 4, "review_text": "3.5 - 4 Stars \n I ADORE Renee Carlino and I think that all of her other books are beautifully written. 'Not in This Life' is one my top favorite books! 'Lucian Divine' did not have the depth that I expect from this writer's work. There was plenty of \"tell\" but not enough show. This lack of detail led to me not really feeling the bond between the main characters. \n Without spoiling the plot, there are just too many open questions in this book. The ending felt rushed. There are elements of romance, sex and even humor here, but I never \"felt\" the love between Evey and Lucian. I like that the author wrote a story that is certainly different and unexpected. Some readers may enjoy this type of book, but it was just not for me. I loved the Epilogue and the ending for these characters was perfect. Definitely try this one and judge for yourself! \n (ARC provided in return for an honest review.)", "date_added": "Wed Sep 14 08:56:22 -0700 2016", "date_updated": "Mon Jan 09 23:13:40 -0800 2017", "read_at": "Sun Jan 08 14:18:24 -0800 2017", "started_at": "Fri Jan 06 00:00:00 -0800 2017", "n_votes": 16, "n_comments": 0}
{"user_id": "01ec1a320ffded6b2dd47833f2c8e4fb", "book_id": "32615117", "review_id": "9d796d76a77c5e5b239ef5383b829e23", "rating": 4, "review_text": "4.5 Stars! \n Sensual, powerful, romantic and very sexy. I don't read much PNR but Sylvain Reynard is an exception. Very bittersweet to see the series end! Full review to follow.", "date_added": "Thu May 12 06:43:22 -0700 2016", "date_updated": "Tue Nov 29 14:55:15 -0800 2016", "read_at": "Tue Nov 29 14:55:15 -0800 2016", "started_at": "Wed Nov 23 00:00:00 -0800 2016", "n_votes": 10, "n_comments": 0}
{"user_id": "01ec1a320ffded6b2dd47833f2c8e4fb", "book_id": "25476303", "review_id": "553ebc63aaad5809a992a73258ec5b62", "rating": 5, "review_text": "The Shadow is a lush, passionate and complex story, filled with romance, art, history and suspense. I am not a huge fan of paranormal stories but I make an exception for Sylvain Reynard's books. I LOVE the Gabriel's Redemption series and Professor Gabriel Emerson makes an appearance here. What more could you ask for? \n William and Raven are reunited in this story but William is battling forces who are trying to sabotage him. He has finally found the love of his life and he wants nothing more than to worship Raven forever. \n \"I will never have your nobility of spirit, or your protective nature, but as long as I have your love, I can be content.\" \n William will stop at nothing to protect Raven from both other vampires and from those who scheme to drive them apart. There is lots of action and mystery, written in the style that is completely unique to Sylvain Reynard. This is a very sensual and passionate book, and even if you do not usually read paranormal romance, you will love this story. The streets of Florence seem to come alive! \n We also learn about William's early life and the tragic story of how he lost his first love. Raven is completely trusting of him and along with the intrigue, there is also a little humor here, too. \n \"You're giving me a toothache.\" \n He pulled back. \"How is that possible?\" \n She laughed. \"It's a figure of speech. It means you're being too sweet. Say something awful.\" \n William's expression changed and he brought his lips to her ear. \"I want to take you back to the house, so I can spread you on my bed and do all kinds of wicked things to you.\" \n I can't wait to see what happens next! The Shadow is a beautifully written book and my favorite in the Florentine Series so far. Lush, lyrical, passionate and very intense. The outtakes are absolutely fantastic. Don't miss it!! \n (ARC provided by the publisher in return for an honest review.)", "date_added": "Wed Oct 28 00:18:30 -0700 2015", "date_updated": "Mon Feb 01 22:50:07 -0800 2016", "read_at": "Wed Jan 27 00:00:00 -0800 2016", "started_at": "Sun Jan 24 00:00:00 -0800 2016", "n_votes": 23, "n_comments": 0}
{"user_id": "01ec1a320ffded6b2dd47833f2c8e4fb", "book_id": "23300367", "review_id": "c3a6842c6c01d310a01c026f23f232f1", "rating": 4, "review_text": "do not read much paranormal romance but I highly recommend this book! The characters and the story won me over. Mitch and Frederick are twins and both alpha wolves. Mitch stayed in their area, even after his brother found a mate and even though he accepted that he would forever be alone. \n Frederick and Simon meet by chance and once again, Cardeno C.'s incredibly loving, warm and sweet style took over to give these two the full life they had both been missing. \n Blue Mountain is a fairly short story, but is a wonderful, sweet addition to the author's work. Although Simon and Frederick are only really together towards the end of the story, the story and the characters really mesh perfectly together and I loved the direction the story took. I absolutely adored the narrator of this audiobook, even though I liked him best as the voice for Frederick and Mitch. I would like to hear Sean Crisden again as the narrator in future audiobooks. I highly recommend this story and the audio book for any reader of the m/m genre, even those new to the shapeshifter genre. Thank you, Cardeno C. for broadening my reading horizons once again! \n (A complimentary copy of the audiobook was provided in exchange for an honest review.)", "date_added": "Sun Jan 18 08:18:05 -0800 2015", "date_updated": "Sun Jan 18 08:44:07 -0800 2015", "read_at": "Thu Jan 15 00:00:00 -0800 2015", "started_at": "", "n_votes": 2, "n_comments": 0}
{"user_id": "01ec1a320ffded6b2dd47833f2c8e4fb", "book_id": "22843247", "review_id": "6ad4d9c1f655f6adc049441884fe2177", "rating": 5, "review_text": "The Prince, Sylvain Reynard's novella, is darkly sexy, fascinating, and highly addictive. The author's writing is completely hypnotic and very powerful. The story is a wonderful introduction into the new Florentine Series, and features the stunning Professor Gabriel Emerson and his beloved Julianne. However, we meet a whole new set of characters in this very sexy, paranormal romance. I absolutely fell in love with the story! \n The Prince is ruthless, cunning, and powerful. But what mysteries is the Prince hiding? And what secrets will he uncover? I can't wait to find out in The Raven. This story can be devoured in one sitting, and will leave you wanting more. The setting is broody and mysterious, and the bridge between the Gabriel Trilogy and the Florentine series is simply brilliant. I have sorely missed Sylvain Reynard and I anxiously await the The Raven! \n (ARC provided by the author in return for an honest review.)", "date_added": "Wed Sep 10 18:40:01 -0700 2014", "date_updated": "Sat Jan 17 17:20:53 -0800 2015", "read_at": "Thu Jan 15 00:00:00 -0800 2015", "started_at": "Thu Jan 08 00:00:00 -0800 2015", "n_votes": 12, "n_comments": 0}
{"user_id": "01ec1a320ffded6b2dd47833f2c8e4fb", "book_id": "20530499", "review_id": "eaaaff12aa9423cf56151a8709d74eb8", "rating": 4, "review_text": "4.5 stars!! Kitty Thomas is my go-to author for dark erotica so I was excited to read her new release. Blood Mate is a FAIRY TALE, not really an erotic romance in any way, and is another intense story from Kitty Thomas. I don't normally read this genre of books but I absolutely loved the writing and the characters and am so glad I had the opportunity to read this book. \n August is a very powerful vampire who is cursed to forever take human victims on order to ensure his own survival. He was a good man in his former life and he desperately wants to break his curse. To do this, he must find his \"blood mate\", a woman whom he cannot \"enthrall\" or control via her mind, and who will stay with him throughout eternity. \n August finds Nicole, who is actually very happily married. Through a series of twists and turns, August creates a situation where Nicole will become his blood mate, but she doesn't give in so easily, and is a very strong and feisty heroine. August is torn by his actions but he absolutely must ensure his own survival. \n Only Kitty Thomas could create a cast of strong characters like those in Blood Lust and an fantastically creative story that will keep you guessing until the very end. \n If you want to step outside your usual genre of books, I highly recommend this dark and sensual tale. You will not be disappointed. \n (ARC provided by the author in return for an honest review.)", "date_added": "Fri Jan 31 10:07:23 -0800 2014", "date_updated": "Sun Mar 09 14:21:08 -0700 2014", "read_at": "Sun Mar 02 00:00:00 -0800 2014", "started_at": "Sun Mar 02 00:00:00 -0800 2014", "n_votes": 0, "n_comments": 0}
{"user_id": "01ec1a320ffded6b2dd47833f2c8e4fb", "book_id": "18965316", "review_id": "714e2939cb02b7be528057f16dddad23", "rating": 5, "review_text": "A lush, sensual, erotic and suspenseful story that is at once poignant and dangerous. Another must-read from.SR and easily one of my top reads of 2015!! \n To say that I was ecstatic to read this book is an understatement. \n The Raven has everything I love about Sylvain Reynard's writing and more. Lyrical, erotic, sensual and mysterious, The Raven begins another addictive series with the introduction of Raven and the Prince. This book is a must-read!! \n Professor Emerson and his wife do appear here, but Raven and the Prince are themselves insanely fascinating. Even if you are not a huge fan of paranormal stories, this book is a must read for the thrilling story and lush, intensely sexual scenes. We are introduced to the Prince, leader of the City of Florence, who is at once cold and calculating but beautiful in his own right. He cannot stay away from Raven and feels compelled to help her again and again. He sees in her virtue and goodness, and she awakens long-dormant feelings that he never believed he could have, even at his own peril. \n \"I'm afraid that trouble is not what you do. Trouble is what you are.\" \n Raven is an unlikely heroine and I fell in love with her! She is damaged goods, inside and out, and her painful history is hinted at and then ultimately explained. She is an extremely sympathetic character and I cannot wait to read more about her in the next book. The Prince, too, is surprised at his attraction to her; might she lead him to redemption and true love? \n \"In many ways, we are the most perfect match. We see each other as we are, but neither of us views the other as broken.\" \n I am not articulate enough to adequately describe the virtues of this book! Part art history lesson, part paranormal romance, part erotica, it is a must read for all fans of Gabriel's Inferno - and even for those readers new to the series. This book can be read as a standalone but is best understood after having read the GI series. The Raven is engrossing, suspenseful, sexy and and yes, humorous. Do not miss this book! And while it has a a fabulous conclusion, there is much, much more to come for these characters and I cannot wait for more!! \n Favorite quote: \n \"You are my greatest virtue and my deepest vice.\"", "date_added": "Wed Nov 27 17:10:46 -0800 2013", "date_updated": "Wed Feb 04 19:37:36 -0800 2015", "read_at": "Sun Feb 01 00:00:00 -0800 2015", "started_at": "Fri Jan 30 00:00:00 -0800 2015", "n_votes": 20, "n_comments": 6}
{"user_id": "01ec1a320ffded6b2dd47833f2c8e4fb", "book_id": "18102827", "review_id": "b8a0ab496bcb1627ab4979466d1d64bd", "rating": 4, "review_text": "I don't usually read a lot of paranormal books so King Hall was a little something different for me! This is a magical, imaginative story that follows Lily, a young prodigy who is suddenly forced to become a leader along with three other friends. Lily is a \"hybrid\", which is very dangerous in the mystical world created by Scarlett Dawn. The action-packed story follows young Lily as she experiences loss, self-doubt and many epic challenges on her path to becoming the leader she is meant to be. \n The author has created some great supporting characters in Ezra, Jack and Pearl. I especially enjoyed reading about the relationship and strong connection between Lily and Ezra, the sexy Vampire. There is lots of talk about sex and sexual tension in this book, but nothing too explicit. \n King Hall ends with a cliffhanger, but it is the kind of ending that leaves you ready for the next installment in this story! This book was a very different read, and I recommend it for anyone interested in stories about magical, mystical worlds. \n I received this book from NetGalley in exchange for an honest review.", "date_added": "Wed Jun 19 08:58:59 -0700 2013", "date_updated": "Tue Jul 23 20:36:26 -0700 2013", "read_at": "Tue Jul 23 00:00:00 -0700 2013", "started_at": "Mon Jul 22 00:00:00 -0700 2013", "n_votes": 0, "n_comments": 0}
{"user_id": "01ec1a320ffded6b2dd47833f2c8e4fb", "book_id": "16159713", "review_id": "f10d844499f0814b2ada131e83af1188", "rating": 5, "review_text": "\"I love her, more than anyone should love anything. The kind of love that either fills you up or eats away at you. I love her at my own risk. I love her dangerously.\" \n I call this book \"The One Where Karina Halle Rips Your Heart Out and Stuffs It Down Your Throat.\" In AWMCTL, we feel every drop of Dex's anguish about his feelings for Perry. It is told from Dex's POV and because this is a spoiler-free review, let's just say that the author really knows how to wring every drop of honesty and truth from her characters. \n \"Shut the fuck up, man. Get over it. Shape up or ship out. Don't think I wasn't yelling those things in my head. But when the fuck did my head and heart get along anyway? They were mortal enemies now, sworn to rip each other to shreds.\" \n But since this part of the EIT series after all, there is still plenty of action to go around. When Dex is abruptly summoned by Little Fifteen aka Ada to help Perry, he doesn't hesitate to jump right back into the fray to save Perry from mortal danger. \n \"You're my light in all this madness, Perry,\" I whispered, knowing she couldn't hear me. \n Obviously, I can't wait to see where the author takes Dex and Perry in Come Alive (Book 7), to be released on June 23, 2013!And With Madness Comes the LightKarina Halle", "date_added": "Wed May 15 11:11:22 -0700 2013", "date_updated": "Fri Jun 14 21:08:28 -0700 2013", "read_at": "Thu Jun 13 00:00:00 -0700 2013", "started_at": "Tue Jun 11 00:00:00 -0700 2013", "n_votes": 0, "n_comments": 0}
{"user_id": "01ec1a320ffded6b2dd47833f2c8e4fb", "book_id": "11729060", "review_id": "ad865724a66d5fe0f62bc869621a5f5d", "rating": 5, "review_text": "I'm hooked! Can't wait to read rest of series. And I LOVE DEX!", "date_added": "Tue May 07 05:14:35 -0700 2013", "date_updated": "Thu Jun 06 14:16:56 -0700 2013", "read_at": "Thu Jun 06 14:16:56 -0700 2013", "started_at": "Sun May 26 00:00:00 -0700 2013", "n_votes": 0, "n_comments": 0}
{"user_id": "01ec1a320ffded6b2dd47833f2c8e4fb", "book_id": "17608224", "review_id": "89fca4283e9e51cf3cb011ce0b654817", "rating": 4, "review_text": "4 Fantastical Stars!! \n \"What makes a hero is the one that's left standing when the others are dead. Or the one that gave his life so the others could live. That's a fuckin' hero.\" \n Midnight Soul is the conclusion of the Fantasyland series with Noctorno (Noc) Hawthorne and Franka Drakkar, who was truly evil in the previous books in this series. But in trademark Kristen Ashley style, Franka's true side is shown and all of her secrets are revealed. She has endured terrible abuse for years to protect her brother and his family which she has hidden from everyone around her. \n Not and Franka begin a very slow-burn romance that at first begins as a friendship and partnership. Kristen Ashley expertly weaves fantasy, paranormal and reality with touches of comedy and as always, a beautiful and enduring romance. The scenes of Franka and others from her world being introduced to the modern world are funny and thought-provoking and always entertaining. \n Noc sees the real Franka and his love transforms her. I always tell friends who don't usually read fantasy that Kristen Ashley's books are magical and engrossing and Midnight Soul is no exception. The journey that Franka takes is filled with forgiveness and redemption and yes, a swoony Alpha who will stop at nothing to protect Franka and her loved ones. \n Midnight Soul is an imaginative and sexy conclusion to the Fantasyland series. It is filled with unforgettable characters and as always, a magnificent Epilogue! \n \"You don't have a midnight soul, Frannie. Your soul is so bright, I look too close, I'd be blinded.\" \n (ARC provided by the author in return for an honest review.)", "date_added": "Thu Mar 28 07:42:43 -0700 2013", "date_updated": "Sat Aug 13 22:49:25 -0700 2016", "read_at": "Sat Aug 13 00:00:00 -0700 2016", "started_at": "Wed Aug 10 00:00:00 -0700 2016", "n_votes": 7, "n_comments": 1}
{"user_id": "01ec1a320ffded6b2dd47833f2c8e4fb", "book_id": "17346804", "review_id": "02c7cf152e53e22edff3d781eff5d203", "rating": 5, "review_text": "Kristen Ashley is my favorite author. Her books make my heart pound, get my pulse racing, make me cry, make me laugh and wrap me, always, in a cocoon of family, friendship and love. Could you ask anything more from a writer? And Wild And Free, the third installment in the Three Series, does all of that, and much, much more. \n Wild and Free contains some of the rawest, animalistic, sensual and gorgeous love scenes I have ever read. Abel and Lilah, destined to be mates for life, need to be able to draw you in to their characters and their fated mating for this to be a believable story. And boy, do they ever! Just when I think Ms. Ashley could not possibly create a more Alpha male than she already has, she writes Abel, who is a hybrid and who mates like nobody's business!! \n This book contains everything you could possibly hope for in a paranormal romance. There is incredible, heart-stopping action, hot sex, other-wordly beings, super-hot sex, wolves, vampires and heart-pounding sex! I absolutely loved Abel and his story broke my heart. Lilah is a kick-ass heroine, brave, uninhibited, sexual. loyal and loving. These two together just might save the world. \n I could not put this book down and was literally swooning at every page. Even if you are not a big fan of paranormal romance, and I do not read a lot of them, Wild And Free is a MUST-READ. This book is truly Kristen Ashley at her finest. She is not afraid to pull the punches and make sacrifices when they work for the story. And for that, I love her. Be prepared to be wowed. Wild And Free has loads of unexpected twists and turns and it is a vital addition to your KA library!! \n (*ARC provided by the author, with thanks, for an honest review.)", "date_added": "Mon Feb 25 17:49:21 -0800 2013", "date_updated": "Sun Jan 04 08:00:13 -0800 2015", "read_at": "Fri Dec 26 00:00:00 -0800 2014", "started_at": "Mon Dec 22 00:00:00 -0800 2014", "n_votes": 14, "n_comments": 0}
{"user_id": "01ec1a320ffded6b2dd47833f2c8e4fb", "book_id": "12390650", "review_id": "61d30c3ab16571ee9bfa9296e3237a78", "rating": 5, "review_text": "Never in a million years did I think I would love a book about a parallel world with elves, kings, magic...but this is Kristen Ashley, after all, so I fell in love with this book!! I was enthralled by this story and felt transported to this world that Ms. Ashley created. In search of an epic adventure, Finnie trades places with her \"twin\" who lives in a parallel universe. Immediately she is swept off to marry the king in an arranged marriage. He then leaves her alone in the middle of the woods and so begins this epic tale that had me swooning at every word. \n Frey Drakkar is uber-sexy, controlling and at first, non-communicative. But slowly these two develop a bond that is beautiful and lasting and quite magical. I am not a huge reader of fantasy but this book is quite simply unforgettable. The characters came alive for me and the story is amazing. Even if you are not a fan of this genre, read this book!! Wildest Dreams is everything I love about Kristen Ashley.", "date_added": "Tue Aug 28 12:02:09 -0700 2012", "date_updated": "Thu Jun 30 22:01:40 -0700 2016", "read_at": "", "started_at": "", "n_votes": 7, "n_comments": 0}
{"user_id": "4b3636a043e5c99fa27ac897ccfa1151", "book_id": "9369720", "review_id": "6f8905f397463a0c5a58d516612f1311", "rating": 1, "review_text": "Groan, eye roll, page turn, repeat. \n Just kidding when I said this was better than Twilight. The writing in this book makes Stephenie Meyer comparable to Hemingway.", "date_added": "Sun Feb 15 21:04:56 -0800 2015", "date_updated": "Fri Feb 20 09:20:48 -0800 2015", "read_at": "Wed Feb 18 00:00:00 -0800 2015", "started_at": "Sun Feb 15 00:00:00 -0800 2015", "n_votes": 0, "n_comments": 0}
{"user_id": "4b3636a043e5c99fa27ac897ccfa1151", "book_id": "7740152", "review_id": "acef15128c3afc11081b8647b43a6862", "rating": 2, "review_text": "I am so tired of YA books where the female character is weak and conflicted and the love interest is chiseled, gorgeous, and borderline abusive. Disappointing.", "date_added": "Sun Feb 01 10:47:10 -0800 2015", "date_updated": "Fri Feb 20 09:24:51 -0800 2015", "read_at": "Sat Feb 14 00:00:00 -0800 2015", "started_at": "Sun Feb 01 00:00:00 -0800 2015", "n_votes": 0, "n_comments": 0}
{"user_id": "4b3636a043e5c99fa27ac897ccfa1151", "book_id": "6487308", "review_id": "5edd924e243392f7789ddd11ded7851d", "rating": 2, "review_text": "Well...it's way better than Twilight, but that's not really saying much. Unfortunately, I can't NOT read a sequel- so book 2, here I come.", "date_added": "Sun Feb 01 10:44:09 -0800 2015", "date_updated": "Sun Feb 01 10:46:40 -0800 2015", "read_at": "Sun Feb 01 10:46:40 -0800 2015", "started_at": "Fri Jan 30 00:00:00 -0800 2015", "n_votes": 0, "n_comments": 0}
{"user_id": "4b3636a043e5c99fa27ac897ccfa1151", "book_id": "15848274", "review_id": "74f24d96af9be9c5363e77c5cb4391ce", "rating": 1, "review_text": "....um.... I blame Kristen.", "date_added": "Wed May 28 07:47:36 -0700 2014", "date_updated": "Wed May 28 07:48:01 -0700 2014", "read_at": "", "started_at": "", "n_votes": 0, "n_comments": 1}
{"user_id": "4b3636a043e5c99fa27ac897ccfa1151", "book_id": "428263", "review_id": "73ee970fcf6b3226da30aa20e0abeedb", "rating": 2, "review_text": "It's like a horrible car accident that I can't stop staring at. Make it go away.", "date_added": "Mon Dec 19 21:48:06 -0800 2011", "date_updated": "Thu Dec 22 13:36:07 -0800 2011", "read_at": "Mon Dec 19 00:00:00 -0800 2011", "started_at": "Mon Dec 19 00:00:00 -0800 2011", "n_votes": 0, "n_comments": 0}
{"user_id": "4b3636a043e5c99fa27ac897ccfa1151", "book_id": "49041", "review_id": "3c36435e6d4d993cb8bd5b47adf8d6eb", "rating": 2, "review_text": "Ugh. Why am I putting myself through this?", "date_added": "Wed Dec 07 09:23:19 -0800 2011", "date_updated": "Thu Dec 22 13:31:18 -0800 2011", "read_at": "Thu Dec 15 00:00:00 -0800 2011", "started_at": "Fri Dec 09 00:00:00 -0800 2011", "n_votes": 1, "n_comments": 0}
{"user_id": "4b3636a043e5c99fa27ac897ccfa1151", "book_id": "27003", "review_id": "7e379016ff5a4bb428a097045f73d6ca", "rating": 4, "review_text": "It was totally campy and fun. Exactly what I needed. I mean how can you not enjoy a book with characters named Jack Schitt and Braxton Hicks?", "date_added": "Fri Jun 03 21:49:51 -0700 2011", "date_updated": "Fri Aug 23 09:24:40 -0700 2013", "read_at": "Thu Jun 09 22:03:03 -0700 2011", "started_at": "Fri Jun 03 00:00:00 -0700 2011", "n_votes": 0, "n_comments": 0}
{"user_id": "4b3636a043e5c99fa27ac897ccfa1151", "book_id": "41865", "review_id": "7b8b381dade8f398b88b0ab8c9ec697e", "rating": 3, "review_text": "If I was 15, I would have LOVED this. It wasn't terrible, in fact, it was the perfect quick read for a rainy weekend. I'm going to give the second book a chance.", "date_added": "Wed Mar 11 11:22:16 -0700 2009", "date_updated": "Fri Sep 13 08:47:42 -0700 2013", "read_at": "Mon Nov 21 00:00:00 -0800 2011", "started_at": "Thu Nov 17 00:00:00 -0800 2011", "n_votes": 0, "n_comments": 1}
{"user_id": "903d4b859e86a1dd6d7640849cc7067c", "book_id": "6282915", "review_id": "b3fe302e86562af12af5bd77e660465c", "rating": 4, "review_text": "It's been at least 10 years since reading an Anne Rice novel, and I'm reminded why I've read more of her books than any other author. I feel at times the plot seemed slow in this book, but when I finished it, I felt like the undertones of the book said more than the story itself. It's not necessarily the events that happen, but the reactions and emotions to them. It's getting to know the mind of the characters. That's why I like Anne Rice.", "date_added": "Mon Jun 15 12:09:23 -0700 2015", "date_updated": "Sun Jun 28 13:00:25 -0700 2015", "read_at": "Sun Jun 28 13:00:25 -0700 2015", "started_at": "Mon Jun 15 00:00:00 -0700 2015", "n_votes": 0, "n_comments": 0}
{"user_id": "903d4b859e86a1dd6d7640849cc7067c", "book_id": "140082", "review_id": "0730bc484d0a2a0a0fa073c40dcefe67", "rating": 3, "review_text": "Considerably better than book #2 (Dead in Dallas), still hoping it'll get better.", "date_added": "Wed Oct 22 07:00:52 -0700 2014", "date_updated": "Wed Oct 22 07:02:25 -0700 2014", "read_at": "Mon Oct 20 00:00:00 -0700 2014", "started_at": "", "n_votes": 0, "n_comments": 0}
{"user_id": "903d4b859e86a1dd6d7640849cc7067c", "book_id": "110494", "review_id": "992df40030d8bc3aa69c9b5aed8d8f5d", "rating": 1, "review_text": "I'm wondering if my love for the show has skewed my appreciation of the books. But in my opinion, simply the structure of this book was dismal. The book begins with the set up of the Maenad plot, only to drop it and cut to Dallas, for that to end abruptly and then back to the Maenad where we haven't had any plot development and then the book is over. Neither plots are tied to each other in any way, and most the characters and relationships seem completely devoid of actual emotion. And this may be harsh, but I think there was more character development in Twilight.", "date_added": "Thu Sep 04 07:47:16 -0700 2014", "date_updated": "Sun Oct 19 10:45:12 -0700 2014", "read_at": "Sat Oct 18 00:00:00 -0700 2014", "started_at": "Thu Sep 04 00:00:00 -0700 2014", "n_votes": 0, "n_comments": 0}
{"user_id": "afc070543f19028dc7e7f084a0079f72", "book_id": "18131", "review_id": "947ee61d4b08710748b6ddf5a9af92f2", "rating": 5, "review_text": "A tremendous book. Missed this when I was a young girl. Love the spiritual path of this book woven into a science fiction novel. A very quick read for an adult. A profound read for the young.", "date_added": "Tue Nov 29 10:34:03 -0800 2016", "date_updated": "Fri Dec 16 09:36:56 -0800 2016", "read_at": "Thu Dec 01 00:00:00 -0800 2016", "started_at": "Thu Dec 01 00:00:00 -0800 2016", "n_votes": 1, "n_comments": 0}
{"user_id": "dc3763cdb9b2cae805882878eebb6a32", "book_id": "15813776", "review_id": "95f7b872ad96e0586a2cdd82f275d0b4", "rating": 4, "review_text": "Witches Bureau of Investigation is the first of two books by Richard Capwell in the series the first one at least, featuring young Nate and Herman Howe. Richard Capwell has self-published 10 books including \"The Domain of Dragons\" series of fourbooks from what I can tell based on goodreads.com. As stated in the intro book blurb at the top of this review. Young Nate and Herman Howe accidentally (or was it?) run into literally, Mrs. Weatherby outside a coffee shop spilling her latte everywhere. Through the boys chivalry, Mrs Weatherby hands the boys her business card that reads that she is the retired Director of the Witches Bureau of Investigation, tells them if they ever need anything to call on her then drives away. It just so happens the boys mother has been missing for six months under mysterious circumstances, at least to those who knew Mrs. Howe. The police have closed the case, tying her disappearance to a man who embezzled some money from the company they both worked for during her vacation and her having an affair and running away with him. The boys don't believe this for a second, neither does their father who tirelessly looks for her and takes care of the boys with the help of his mother. \n After discussing it together that evening while trying to do research on the WBI, the boys decide to call Mrs. Weatherby. They meet up the next morning and soon begins the adventure the boys could never have imagined. The boys, Mrs. Weatherby, her Chauffeur Beauchamp illicit help from other former WBI investigators to help find the boys mother. All along the way, the boys have to hide what is going on from their father, deal with a very nasty neighbor lady who is always watching them like a hawk and Mrs. Weatherby's daughter is trying to have her put in a nursing home and have her declared incompetent so she can get at Mrs. Weatherby's money. The team find them selves in for more than they bargained for as it looks like there maybe corruption at the WBI, some very powerful missing magic artifacts, at least one rogue witch and no one is sure who they can trust. \n Capwell does a formidable job with light romp of a story that shows he can create a depth of character, tell a story and leave the reader wanting more. The Witches Bureau of Investigation was extremely well written in the sense that you feel like you got to know a lot about the characters in a very short time. The book itself is only 179 pages long. The description and the dialogue was all very unique for each character. The story plot while yet a bit predictable was still very entertaining and a few twists and turns kept me guessing all along the way. \n I have to admit, I was surprised by how much I liked this book. It was very well written in terms of characterization, pace, action and humor. Capwell did a great job of bringing the characters to life in this light weight novel of paranormal adventure. It is written so people of any age can enjoy it and feel like the got not only an easy read, but a very good one at that. One of the other things I loved was the editing was very good in my opinion. So often with self-published works, the editing is not done very well and that can make the book very hard to read or at least enjoy. \n So in conclusion, Witches Bureau of Investigation is a recommended read for those that love a bit of fun, humor, action, paranormal and wit in the books. The only issue I have is, it could have been a bit deeper and a bit more mystery to it if it had been a longer book. But that is a small issue considering what came out of it. \n Club Fantasci Scoring (Based on scale of 10): \n Cover Artwork: 8 Editing: 9 Re-readability: 7 \n Club Fantasci Overall Score: 8 \n I am giving Witches Bureau of Investigation 4 out of 5 stars because it was a solid read full of characters, action, humor and a solid plot but also because it was a bit short. It might have been five other wise. \n This book is Club Fantasci Certified! \n Club Fantasci Certified \n Author Website: None available \n Author Facebook: https://www.facebook.com/richard.capw... \n Author Twitter: https://twitter.com/RichardCapwell \n Author Google+: None available \n Author Goodreads Page: https://www.goodreads.com/book/show/1... \n Note: A review copy of this book was not provided to me. \n If you like what we bring, please join us on Goodreads.com here: https://www.goodreads.com/group/show/... \n Club Fantasci on Facebook: www.facebook.com/clubfantasci \n Club Fantasci on Twitter: www.twitter.com/clubfantasci \n Club Fantasci on Google+: Club Fantasci", "date_added": "Tue Jul 29 17:04:23 -0700 2014", "date_updated": "Mon Aug 18 08:10:27 -0700 2014", "read_at": "Tue Aug 05 00:00:00 -0700 2014", "started_at": "Tue Jul 29 00:00:00 -0700 2014", "n_votes": 0, "n_comments": 0}
{"user_id": "dc3763cdb9b2cae805882878eebb6a32", "book_id": "13446443", "review_id": "c1045c29498fbf3a098219e238140379", "rating": 3, "review_text": "\"Between The Devil And The Deep Blue Sea\" written by author J. L. Murray is the first in a series based on the fictional character of Niki Slobodian. J. L. Murray is a full-time writer with additional series credits to her resume such as the \"After The Fire\" series and Jenny Undead. The Niki Slobodian Series consists of five novels at this time and I have only read the first book so please take this into account with this review. \n In the book \"Between The Devil And The Deep Blue Sea\" we find our main character Niki Slobodian out of work, struggling to pay her bills and taking care of her god mother \"Sofi\" who is in the hospital with cancer and finding herself on \"The Registry\" for the last year with no hope of getting off and not allowing her to work because she is an \"abnormal.\" She somehow finds a bar called the \"Deep Blue Sea\" and walks in only to be approached by a gentleman named \"Sam\" who seemed to know everything about her, makes her a job offer and a large payment for her services. Niki of course takes the offer out of necessity and ends up on some unknown super secret police squad that deals with supernatural threats. Niki sets out to solve this case and get her life back on track hopefully for good. Partnered with a wizard named \"Gage\" that doesn't really understand how he knows what to do, she has to deal with a police chief that wants her head, a mayor that mysteriously keeps popping up in all the wrong places, a former boyfriend and police offer assigned to help her and having to face her estranged father who is in prison as being the first abnormal ever convicted. \n This book was a bit of a cliche' for me. A down on their luck character facing insurmountable odds. A mysterious character (Sam) who just happens to be super powerful and influential that can do what no one else can. A dark brooding partner we never really learn that much about. A powerful father who abandoned his daughter and Niki can't stand only to find out the truth later and so on and so on. There wasn't much here that wasn't completely predictable and absolutely zero twists and turns in this book. \n A few of the major issues for me was the complete lack of any ability to say anything other than \"I said,\" \"she said,\" or \"he said\" to end a characters statement. Not one \"... remarked\" or \"... agreed' or anything other than \"...said.\" That got to be very annoying and probably my biggest gripe in the book. The use of salt in this book was another huge cliche' right out of any \"Dresden Files\" book or \"Supernatural\" episode. While it wasn't a major issue, it just didn't seem very creative to me and was a very easy fall back. The ease of which the major big bad was finished off especially since he was invulnerable or un-killable. To be offed that easy by two complete novices with something as routine and wrote as the weapon was a very weak ending. I can't imagine in all the years of the human race the people fighting the supernatural, not one \"experienced\" person tried this on a major creature to figure it out. \n The book is very short and shallow as far as any real depth of character. There isn't a whole lot of development in it. Niki herself only reflects on herself or doubts for about one paragraph, the rest of the time she is the typical strong female lead character who is quick-witted, smart, sarcastic and bad ass that we have all become way to used to. \n J.L. Murray gives us a book that is more of an action movie like the Transformers except nowhere near as long. There is plenty of action. It moves at a good pace actually. The story in spite of my criticism doesn't ever seem out of line or not believable, it's just not different enough to really shake it's self from all the other paranormal action adventures out there. If this book were longer, with better character development, a bit more editing and a hair more creativity, I would have really liked it. That being said, it is still better than many I have tried to read lately. \n The author has talent and I am sure gets better as the series goes on. The book was good enough for me to want to read the next in line to see if the character develops any and find out if \"Sam\" is who I think he is. It's a decent effort and I can see a lot of potential for this author in the future. \n I am giving \"Between The Devil And The Blue See\" 3 out of 5 stars because the book was action packed enough to keep my interest. There weren't any boring parts or things that got lost or muddy in it. A little lacking on development and a lack of constructive editing as well as the short length are all that held this back. \n Note: A review copy of this book was not provided to me. \n The original review was posted here: http://clubfantasci.com/devil-deep-bl... \n Club Fantasci on Facebook: www.facebook.clubfantasci \n Club Fantasci on Twitter: www.twitter.com/clubfantasci \n Club Fantasci on Google+: Club Fantasci", "date_added": "Mon Jul 28 16:45:17 -0700 2014", "date_updated": "Mon Jul 28 18:29:29 -0700 2014", "read_at": "Mon Jul 28 00:00:00 -0700 2014", "started_at": "", "n_votes": 0, "n_comments": 0}
{"user_id": "dc3763cdb9b2cae805882878eebb6a32", "book_id": "4268273", "review_id": "b2b5e4f09ebc7597f8531b50641f7e0e", "rating": 4, "review_text": "I was pretty happy with this book in general as it was a fun read and fairly engaging. It did remind me of another book series from another author but only in the comedic sense. The characters were all real defined and interesting and in some ways the support characters were stronger and more memorable than the main character. \n Main character Gerald Dunwoody is a wizard of the 3rd level and seemingly incapable of any real magic or holding a job. He tramples through life until he answers an ad for a court wizard out of necessity. Desperate for work, he forgets to ask the important questions and accepts the position out of hand not realizing his life was about to change forever. Accompanied by his companion Reg, a female talking bird with a history and support from his genius wizard friend Monk Markham, Gerald finds himself in a political situation like no other. \n Karen Miller writing as K.E. Mills does a good job of creating a believable world and comical but yet serious situation to create her series in that keeps the readers nose in the book and wondering what is coming next. With a limited setting, Miller does what most authors don't which is to tell a real story about characters, growth and companionship. My only real complaints are the lack any real sense of time period and a twist that seemed fore shadowed but led a different direction. It's hard to imagine what the world looks like except for a couple points in the book in which Miller gets a bit more detailed. \n All in all it is a good book with solid character development and a story that compels you to keep reading to find out what happens. A solid 3 1/2 stars out of 5 for me as it is a light read. It is definitely worth the read and following up with the other books in the series.", "date_added": "Sun Feb 03 16:31:18 -0800 2013", "date_updated": "Mon Feb 25 20:55:50 -0800 2013", "read_at": "Fri Feb 22 00:00:00 -0800 2013", "started_at": "Sun Feb 03 00:00:00 -0800 2013", "n_votes": 0, "n_comments": 0}
{"user_id": "dc3763cdb9b2cae805882878eebb6a32", "book_id": "13626269", "review_id": "99817b51926b7d4372af226375e5fcb0", "rating": 4, "review_text": "\"Shadows of the Realm\" for me was a good book and kept me enraptured enough to not want to put it down. It's also the first novel I have read fully on my iPad which is saying something as I much prefer the feel of a book in my hand and all other novels on my iPad have remained unread. \n This is author Dionne Lister's first novel and it is a good first book. It did keep me engaged and wondering what would happen next and it was fairly original which can be hard in a fantasy novel. I don't remember any other fantasy novel that I have read channeling \"magic\" from other dimensions or have a \"GPS\" ability to read where characters are located throughout the world based on their body signature. \n There was decent character development, a good plot although I wasn't totally sure of the big picture and a good pace through out the book. What I did like about this book was it didn't feel like I had read it before in some other novel. I didn't get any real sense of I know what is coming next or typical character traits that all \"heroes\" tend to have. Dionne did a great job of giving us something fresh and a feeling of something unique. It is an easy read and you don't get lost in time changes and so much detail that if you don't stay on top of your reading, you forget important parts. \n My only knocks are not enough political intrigue within the nobility, a quick and unexplained disappearance that I am sure will make itself known in later novels and I don't get enough sense of dread of the consequences if the party fails to accomplish it's mission which we never really find out about it's purpose in this first novel. I guess that could be interpreted as a good way to bring the reader back for the following books. \n All in all a good first novel and I am planning on reading the follow up as the story is pretty solid and the author kept it intriguing enough in general to enjoy the adventure.", "date_added": "Wed Sep 12 19:57:47 -0700 2012", "date_updated": "Fri Sep 28 13:12:54 -0700 2012", "read_at": "Tue Sep 25 00:00:00 -0700 2012", "started_at": "Wed Sep 12 00:00:00 -0700 2012", "n_votes": 5, "n_comments": 2}
{"user_id": "dc3763cdb9b2cae805882878eebb6a32", "book_id": "9361589", "review_id": "d0c52cf6e71c539d1d9488dce590051a", "rating": 3, "review_text": "The Night Circus by Erin Morgenstern - a Review by David Lowry \n When my book club Club Fantasci chose its first \"Book of the Month,\" we had quite the list to go through and pick from. For some reason after discovering this book at a local mom & pop bookstore, it really stuck out to me. The premise was very intriguing, the colors brought to mind what I thought would be a sinister plot and for some reason it kept bringing the movie \"Something Wicked This Way Comes\" to my mind (a favorite from childhood) also a very popular novel by Ray Bradbury from 1962. \n What I got out of the novel was not what I expected. Although I loved the premise of the book, the book itself didn't stand up to what it could have been. Author Erin Morgenstern did turn out a good book for her first novel without a doubt. It has plenty of imagination and creativity. What I felt was missing was any real bond to the characters or any real attachment to the outcome of the love story because that is essential what \"The Night Circus\" is, a love story. \n It starts off with two young children Celia and Marco who are unwittingly looked into a life or death challenge that goes on for their entire life. They know nothing about it, how it works, whom it's against or when it ends. They just exist and are in a combat of sorts against each other until into their adult hood they start to figure out who their opponents are and the stakes if the challenge is lost. \n Along the way, a cast of characters again that you develop no attachment to pepper the story with little bits of their involvement here and there. Two characters die and you don't really even know or care who they are although they are at least partially integral to the circus itself. The story jumps back and forth in time with nothing but a tiny sub-script line at the top of each chapter to let you know of the time shifts and if you are like me and extremely busy, it becomes very hard to keep that all in order as when I am able to read, I read in spurts and very rarely for hours at a time. \n As Celia and Marco grow up and figure out they are pitted against each other in this challenge they had no choice in participating in, they fall in love and of course they have to figure out a way to be together upon discovering that the only way to win the challenge is to be the last to survive. It's a challenge of endurance, who can last the longest before finally giving up because they can't bear it anymore emotionally. \n I won't give away the ending but let's just say it ends very quickly and very anti-climatically. I ended the book thinking to myself how completely unsatisfying it was to read. I do love the premise, I love the potential, but I don't feel it was reached here. Erin Morgenstern is a talented writer; I think her ability to describe detail is very good. Her imagination is fantastic. I just think this story was a bit rushed and the ending was not thought out well to me. There was not enough character development to care about the outcome and the switching between first and second person was a bit off-putting. \n All in all I would give it about three out of 5 stars. I would read another book by the author, but admittedly it would probably be after getting through all my other ones first.", "date_added": "Thu Jul 12 06:05:20 -0700 2012", "date_updated": "Fri Aug 31 20:53:16 -0700 2012", "read_at": "Sat Aug 25 00:00:00 -0700 2012", "started_at": "Fri Aug 03 00:00:00 -0700 2012", "n_votes": 0, "n_comments": 0}
{"user_id": "dc3763cdb9b2cae805882878eebb6a32", "book_id": "47212", "review_id": "cca5cb0e3e46d54ef4cb2d2d57121427", "rating": 5, "review_text": "\"My name is Harry Blackstone Copperfield Dresden. Conjure it at your own risk. I am a wizard. I work out of an office in downtown Chicago. As far as I know, I am the only openly practicing professional wizard in the country.\" \n \"Storm Front\" is the first in a series of 15 books (so far) called \"The Dresden Files\" based on the wizard Harry Dresden in this urban fantasy setting by author Jim Butcher. I admit I have come to this series a bit late as I have known about it for awhile both by recommendation and the TV series called \"The Dresden Files\" (which I loved by the way) and its untimely demise in 2008-09. This series of books is wildly popular enough to have spawned of a TV series as well as an RPG Game. This game is really what pushed me into the novels as I had recently been asked to review the game for a website. After reading through a good portion of both core manuals, I knew I need to read the books as the manuals were cool enough on their own and brought me into a whole new exciting world. I had already purchased the first to two books of the series awhile back and just hadn't gotten around to reading them yet. I am glad I finally did and disappointed I hadn't read them earlier. \n In \"Storm Front,\" Harry is brought in to help consult on a double homicide case with mysterious circumstances, as he is often asked to do with the Special Investigations team of the Chicago Police Department. Detective Karrin Murphy heads this team that brings Harry in to ask his \"advice\" on things out of the ordinary. One of the two deaths have a mob tie to it seemingly and the other death is a bit more puzzling. \n Quickly after leaving the scene of the crime, Harry is confronted by the mob and asked to avoid helping in this case, which of course, Harry declines as he smells something is not quite right with this situation and, well, he needs the money as you can imagine, wizards aren't on everyone's first call list for solving problems. \n Harry gets back to his office for another appointment and finds himself involved in a missing persons case. Unbeknownst to Harry, both cases are of course tied together and things get rough very quickly. Soon Harry is being roughed up by strangers, attacked by a giant scorpion, an known wizard Harry calls Vic \"Shadowman\" is attempting to kill Harry at every possible opportunity, while trying to avoid the mob as well as attempting to help Detective Murphy as much as possible even though he is not able to be completely honest with Murphy as per the rules of the White Council, a type of governing body for wizards unknown to the public. Harry has a Warden of the White Council on his tail all the time it seems who is just gunning to get Harry killed because he doesn't trust Harry and things he works in the \"Black.\" That being black magic of course. Harry's not being able to be honest with the police also lands Harry in hot water to add to his troubles. \n The thing about \"Storm Front\" is it is completely fun! The narration in which the story is told left me chuckling many times. I love a book that has a sense of humor to it. The character of Harry Dresden is one that many people can relate to and it just draws you in. Harry is one of the best at what he does; yet he struggles to make a living. He tries to do the best he can, help as many as he can and yet, things are always going against him. I am sure many of us understand how hard it is to be very good at something, but not make a great living at it. I know that Detective Murphy is a main stay in the series and I am sure her character will be much more fleshed out in the later books as obviously there is a special relationship between her and Harry. \n Butcher does a great job of telling a fun, exciting story that compels you to keep reading. The world is completely imaginable and the tension is just enough to make you want more. Of course I will read the other books in the series as so far \"Strom Front\" has done an amazing job of detailing a world of magic, mystery and danger with a touch of humor and making it completely fun. \n If you love urban fantasy or fantasy books of any kind, I highly recommend \"Strom Front\" to you. You don't want to pass this one up! \n I am giving this book 5 out of 5 stars. \n You can find out more about Jim Butcher and his books here: www.jim-butcher.com \n This review is posted at: http://clubfantasci.wordpress.com/201...", "date_added": "Thu Jul 12 06:04:45 -0700 2012", "date_updated": "Mon Oct 16 00:51:35 -0700 2017", "read_at": "Sun May 26 16:58:44 -0700 2013", "started_at": "Tue May 21 00:00:00 -0700 2013", "n_votes": 0, "n_comments": 0}
{"user_id": "dc3763cdb9b2cae805882878eebb6a32", "book_id": "3227063", "review_id": "e2434d0a3f0ee2d6e313ee6a30993ee8", "rating": 5, "review_text": "Growing up in the nastiest alleys and streets of Cenaria dreaming every minute of better life is how Azoth lives. Day by day wishing for the \"wetboy\" Durzo Blint to apprentice him so Azoth can escape this dreadful life of fear of being beat up everyday if you don't pay your share of the dues and also to take care of his best friends Jarl and Doll Girl. \n It's a dark journey for this young boy to have the weight of so much on his shoulders, watching after Doll Girl whom he feels responsible for and leading a group of rag tag homeless kids against people in his own guild let alone all the others trying to take over their territory. Azoth must destroy his enemy, provide a better life for Doll Girl and somehow get the lands deadliest assassin Durzo Blint to notice him and be willing to apprentice him. And that's all before he reaches his teen years. \n \"The Way of Shadows\" is a rich full book of the life of Azoth later to be named Kylar and his journey to becoming a \"wetboy\" so he can escape reality. The plot twists are many and the character development is really strong. The relationship between Azoth and Durzo is a special one fraught with love, appreciation, jealousy and master/apprentice dynamics. Durzo becomes like a father to Azoth and trains him to become the best \"wetboy\" around. Azoth struggles with the solitary life of an assassin and his love for Doll Girl whom he must abandon to keep her from danger but also provides for her in secret. Sacrificing his life to make sure she has one. It's a love story. \n The characters in Azoth/Kylar's life are very well defined and you develop feelings for them. From his best friend Jarl from the life he left behind to Logan the Prince and soon to be King whom Kylar at this point befriends out of necessity. The double life Kylar must live between lower noble to assassin provides plenty of intrigue and a cast of characters that add a lot of flavor to the book especially Momma K. \n You have all the great things that go in a good fantasy book in \"The Way of Shadows\" and very little of anything negative. I don't want to give anything away in this review but suffice it to say it's a must read fantasy book. For Brent Weeks first novel this is a very strong effort and I can't wait to get to the other two books in the series. \n Find out more about Brent Weeks at www.brentweeks.com", "date_added": "Wed Jul 11 20:12:04 -0700 2012", "date_updated": "Sat Sep 29 12:11:44 -0700 2012", "read_at": "Fri Sep 21 00:00:00 -0700 2012", "started_at": "Thu Sep 06 00:00:00 -0700 2012", "n_votes": 0, "n_comments": 0}
{"user_id": "dc3763cdb9b2cae805882878eebb6a32", "book_id": "42899", "review_id": "aaba9c7b7dec842d6cea04ba2b9a837f", "rating": 4, "review_text": "\"Dark Lover\" is the first in the series of 11 books about The Black Dagger Brotherhood by author J. R. Ward. In the Caldwell, NY of all places the last true pure-blood vampire \"Wrath\" the Blind King has encamped himself and his brotherhood of five other vampires in a half hearted attempt to preserve their race in a turf war with their slayers the \"lessers\". The Blind King wants nothing to do with his heritage and doesn't see himself as strong enough to take up his mantle and lead his race in order to survive. His brotherhood stay faithful in hopes that one day The Blind King will realize his destiny and lead their race into the future so they can prosper again. \n The Blind King finds himself suddenly thrust into protecting the daughter Beth Randall of a slain brotherhood member only to find out that Beth is soon to undergo the change and become a vampire herself. Being completely detached from his emotional senses in order to avoid his calling Wrath starts to come to the realization that he is falling in love and understands that he might have something to live for and protect. Fighting against his desires, instincts, calling and his enemies, Wrath finally is forced to grow \"up\" and face his destiny. \n With a possible assassination attempt on his life from one of the brotherhood, an angry female vampire that feels tossed aside and an angry brother of the female vampire, Wrath's battle come on all fronts. The Blind Kings life jumps from the comfortable solitude of hunt and kill to emotional turmoil, demands from a higher being and learning to trust those around him in a hurry. \n Dark Lover is full of cliches such as the tall, muscle bound, sexy, incredibly attractive male character to the hot damsel in distress that he falls in love with and bodies and sex organs that are way beyond the norm and that feed the it's only hot and sexy if beyond perfect stereotype. While the time frame in which all this happens is extraordinarily fast, the action, the passion and the characters work for the most part once you get past the cliches which are there because the author knows they work. \n If you are going to read a book that has that standard comfortable format in which the reader knows basically what to expect, than this book is not a bad read at all. There are variations on the vampire theme so it's not a traditional vampire but is that a good or bad thing? That is for you to decide as your read a story of love, lust, action and accepting your heritage. \n You can find out more about J. R. Ward here: www.jrward.com \n This review was originally posted here: http://clubfantasci.wordpress.com/201...", "date_added": "Wed Jul 11 19:35:23 -0700 2012", "date_updated": "Tue Jun 11 08:24:07 -0700 2013", "read_at": "Sun Jun 09 00:00:00 -0700 2013", "started_at": "Tue Feb 26 00:00:00 -0800 2013", "n_votes": 0, "n_comments": 0}
{"user_id": "dc3763cdb9b2cae805882878eebb6a32", "book_id": "476692", "review_id": "3e6565f19edddea3f74c8302a37189fc", "rating": 4, "review_text": "Book Review \"Born of Night\" by Sherriliyn Kenyon - David Lowry \n Author Sherrilyn Kenyon needs no introduction, as she has been a best selling author for quite awhile now. In her first book of the \"The League\" series, \"Born of Night\" is a strong opening for what should be a fun group of books to follow. Main character Nykyrian Quikiades is a ruthless assassin that has chosen to lead a group of fellow assassins carrying out contracts and always looking over their shoulder as Nykyrian has turned his back on The League that at one time he was the Command Assassin of. \n Nykyrian rescues the kidnapped Princess Kiara and he and his band of assassins try to keep her out of harms way, facing desperate parents, numerous assassination attempts all while Nykyrian has to come to terms with his tortured past, inability to let any close and his growing feelings for a Princess he has to protect. Princess Kiara is struggling with her unhappy life of expectation in a career that is emotionally draining. Having to learn how to keep her strength up when she is being hunted for reasons she doesn't understand and having a terrifying group of people around her for protection is almost too much to bear. \n While Nykyrian is the typical, unbeatable, extremely good looking main character, the depth of character that is revealed in him is impressive. Kiara although a bit whiney and who wouldn't be going from a palace to targeted for death, goes through her emotional roller coaster we all go through when your solid rock is destabilized in favor of a sudden harsh and terrifying reality is imposed on your life. The self-discovery process that both go through is well thought out and implemented here. \n I think it's fairly obvious that the message here is about not judging a person necessarily by what you see or what little you know of them. Life's circumstances often shape a personality into something that is completely defensive while the real person is dying to get out of their shell. \n \"Born of Night\" has good pacing, exciting action and great character development. 4 out of 5 stars for me. \n See more book reviews at www.clubfantasci.wordpress.com", "date_added": "Mon Jul 02 15:42:29 -0700 2012", "date_updated": "Thu Mar 07 15:37:05 -0800 2013", "read_at": "Tue Feb 26 00:00:00 -0800 2013", "started_at": "Mon Jul 02 00:00:00 -0700 2012", "n_votes": 0, "n_comments": 2}
